Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-exam/umc/js/*.po
Languages: fr

source: #Students
fr: #Élèves

source: <p>For the correct functioning of the exam mode, it is important that all student computers in the computer room are rebooted. The listed computers can be automatically rebooted by pressing the button <i>Reboot students computers</i>. Alternatively multiple computers can be selected and manually rebooted by pressing the button <i>Reboot selected computers</i>.</p><p><b>Attention:</b> No warning will be displayed to currently logged in users! The reboot will be executed immediately.</p>
fr: <p>Afin que le mode examen fonctionne convenablement, il est important que chaque ordinateur d'étudiant dans cette salle soit redémarré. Les ordinateurs listés peuvent être redémarrés automatiquement en appuyant sur le bouton <i>Redémarrer les ordinateurs des étudiants</i>. Il est également possible de sélectionner manuellement plusieurs ordinateurs et d'appuyer sur le bouton <i>Redémarrer les ordinateurs sélectionnés</i>.</p> <p><b>Attention :</b> Aucun avertissement ne sera affiché aux utilisateurs actuellement connectés ! Le redémarrage sera effectué immédiatement.</p>

source: <p>In this text box you can list websites that are allowed to be used by the students. Each line should contain one website. Example: </p><p style="font-family: monospace">univention.com<br/>wikipedia.org<br/></p>
fr: <p>Vous pouvez énumérer dans cette boîte de texte les sites Web que les étudiants peuvent utiliser. Chaque ligne doit contenir un site Web. Exemple : </p><p style="font-family: monospace">univention.com<br/>wikipedia.org<br/></p>

source: <p>Please choose a appropriate directory name for the exam and upload all necessary files one by one.</p><p>These files will be distributed to all participating students. A copy of the original files will be stored in your home directory. At any moment during the exam, it is possible to collect the student files. The collected files will be stored in the exam directory of your home directory.</p>
fr: <p>Veuillez choisir un nom de répertoire correspondant à l'examen et envoyer tous les fichiers nécessaires un par un.</p><p>Ces fichiers seront distribués à chaque étudiant participant. Une copie des fichiers originaux sera stockée dans votre répertoire personnel. À tout moment au cours de l'examen, il sera possible de collecter les fichiers des étudiants. Les fichiers collectés seront stockés dans le répertoire de l'examen dans votre répertoire personnel.</p>

source: <p>Please select the room in which the exam is written and select classes or workgroups that shall participate in the exam.</p>
fr: <p>Veuillez sélectionner la salle dans laquelle l'examen sera rédigé et sélectionner les classes ou groupes de travail participant à l'examen.</p>

source: <p>The exam mode allows one to perform an exam in a computer room. During the exam, access to internet as well as to shares can be restricted, the student home directories are not accessible, either.</p><p>Please enter a name for the new exam and specify its end time</p>
fr: <p>Le mode examen permet de lancer un examen dans une salle informatique. Au cours de l'examen, l'accès à Internet ainsi qu'aux partages peut être restreint, les répertoires personnels des étudiants ne sont pas non plus disponibles.</p> <p>Veuillez saisir le nom de ce nouvel examen et définir son heure de fin.</p>

source: <p>The preparation of the exam was successful. A summary of the exam properties is displayed below.<p><p>Press the button "Open computer room" to finish this wizard and open selected computer room directly.</p><p><b>Attention:</b> For the exam, students are required to login with a special user account by adding <i>{prefix}</i> to their common username, e.g., <i>{prefix}joe123</i> instead of <i>joe123</i>.</p>
fr: <p>La préparation de cet examen a réussi. Un résumé des propriétés de l'examen est affiché ci-dessous.<p><p>Appuyez sur le bouton « Ouvrir la salle informatique » pour conclure cet assistant et directement ouvrir la salle informatique sélectionnée.</p><p><b>Attention :</b> pour l'examen, les étudiants doivent se connecter en utilisant un identifiant spécial en ajoutant <i>{prefix}</i> à leur nom d'utilisateur habituel, par exemple <i>{prefix}joe123</i> au lieu de <i>joe123</i>.</p>

source: Access permissions for shares
fr: Droits d’accès aux partages

source: All exams
fr: Tous les examens

source: Allow access to all shares
fr: Autoriser l'accès à tous les partages

source: An error occurred during the preparation of the exam. The following information will show more details about the exact error. Please retry to start the exam.
fr: Une erreur est survenue lors de la préparation de l'examen. Les informations suivantes vous donneront plus de détails sur l'erreur exacte. Veuillez réessayer de démarrer l'examen.

source: An error ocurred
fr: Une erreur est survenue

source: An unexpected error occurred.
fr: Une erreur inattendue est survenue.

source: Assign internet rules
fr: Assigner des règles Internet

source: Cancel
fr: Annuler

source: Choose the computer room in which the exam will take place
fr: Choisissez la salle informatique dans laquelle l'examen se déroulera

source: Choose the school
fr: Choisissez l'école

source: Close Wizard
fr: Fermer l’Assistant

source: Computer room
fr: Salle informatique

source: Configure share access
fr: Configurer l'accès aux partages

source: Continue without reboot
fr: Continuer sans redémarrer

source: Default (global settings)
fr: Par défaut (configuration générale)

source: Defines restriction for the share access
fr: Définit les restrictions sur l'accès au partage

source: Delete
fr: Supprimer

source: Delete exam(s)
fr: Supprimer le(s) examen(s)

source: Directory name
fr: Nom du répertoire

source: Distribute teaching materials
fr: Distribuer le support de cours

source: Distributed teaching materials
fr: Support de cours distribué

source: Do you really want to delete %s?
fr: Voulez-vous vraiment supprimer %s ?

source: Edit exam
fr: Modifier l’examen

source: Exam files only
fr: Fichiers d’examen uniquement

source: Exam name
fr: Nom de l'examen

source: Exam successfully prepared
fr: Examen préparé avec succès

source: Files
fr: Fichiers

source: Files that are distributed along with this exam
fr: Fichiers distribués avec l'examen

source: Groups that are participating in the exam
fr: Groupes participant à l'examen

source: In this computer room the exam "%s" is currently being executed by %s.
fr: L'examen « %s » est en cours dans cette salle informatique, et est effectué par %s.

source: In this computer room the exam "%s" is currently being written.
fr: L'examen « %s » est en cours de rédaction dans cette salle informatique.

source: List of allowed websites for "{myRules}"
fr: Liste des sites Web autorisés pour "{myRules}"

source: Name
fr: Nom

source: Next
fr: Suivant

source: No class or workgroup has been selected for the exam. Please select at least one class or workgroup.
fr: Aucune classe ni groupe de travail n'a été sélectionné pour cet examen. Veuillez sélectionner au moins une classe ou groupe de travail.

source: No reboot necessary
fr: Aucun redémarrage nécessaire

source: No room has been selected for the exam. Please select a room.
fr: Aucune salle n’a été choisie pour cet examen. Veuillez sélectionner une salle.

source: Not connected / powered down
fr: Non connecté / Éteint

source: Note
fr: Remarque

source: Only own exams
fr: Uniquement ses propres examens

source: Open computer room
fr: Ouvrir la salle informatique

source: Participants
fr: Participant·es

source: Participating classes/workgroups
fr: Classes / groupes de travail participants

source: Personal internet rules
fr: Règles Internet personnelles

source: Planned end of exam
fr: Horaire prévu de fin d'examen

source: Please confirm to reboot all computers marked as <i>Reboot necessary</i> immediately.
fr: Veuillez confirmer le redémarrage immédiat des ordinateurs marqués comme <i>Redémarrage nécessaire</i>.

source: Please select the access restrictions to internet. These settings can also be adjusted during the exam via the room settings in the module <i>Computer room</i>.
fr: Veuillez sélectionner les restrictions d'accès à Internet. Ce réglage peut également être ajusté lors de l'examen par le biais de la configuration de la salle dans le module <i>Salle informatique</i>.

source: Please select the access restrictions to shares. These settings can also be adjusted during the exam via the room settings in the module <i>Computer room</i>. The participating students are not able to access the home directories during the exam.
fr: Veuillez sélectionner les restrictions d'accès aux partages. Ce réglage peut également être ajusté lors de l'examen par le biais de la configuration de la salle dans le module <i>Salle informatique</i>. Les étudiants participants ne pourront pas accéder à leur répertoire personnel au cours de l'examen.

source: Please select your further configuration steps:
fr: Veuillez sélectionner vos étapes de configuration additionnelle :

source: Please specify at least one allowed website or select a different internet rule.
fr: Veuillez indiquer au moins un site Web autorisé ou une autre règle Internet.

source: Prepare new exam
fr: Préparer un nouvel examen

source: Reboot
fr: Redémarrer

source: Reboot computers
fr: Redémarrer les ordinateurs

source: Reboot necessary
fr: Redémarrage nécessaire

source: Reboot selected computers
fr: Redémarrer les ordinateurs sélectionnés

source: Reboot student computers
fr: Redémarrer les ordinateurs des étudiants

source: Rebooting computers
fr: Redémarrage des ordinateurs

source: Regulate share access
fr: Réguler l'accès aux partages

source: Room
fr: Salle

source: Save exam
fr: Enregistrer l’examen

source: School
fr: École

source: School classes
fr: Classes scolaires

source: Search name
fr: Chercher par nom

source: Search pattern
fr: Motif recherché

source: Search...
fr: Chercher…

source: Select a predefined internet rule. Alternatively <i>Personal internet rules</i> can be defined or the standard internet rules of the school administrator can be used.
fr: Sélectionnez une règle Internet prédéfinie. Il est également possible de définir des <i>Règles Internet personnelles</i> ou d'utiliser les règles Internet standard de l'administrateur de l'école.

source: Select room and participants
fr: Sélectionnez la salle et les participants

source: Set up internet rules
fr: Définir les règles Internet

source: Specifies the substring pattern which is searched for in the exams.
fr: Spécifie le motif partiel recherché dans les examens.

source: Start a new exam
fr: Démarrer un nouvel examen

source: Start exam
fr: Démarrer l'examen

source: Starting the configuration process...
fr: Démarrage du processus de configuration...

source: Status
fr: État

source: Take over
fr: Prendre la main

source: The name of the exam, e.g., "Math exam algebra 02/2013".
fr: Le nom de l'examen, par exemple « Test de maths algèbre 02/2016 ».

source: The name of the project directory as it will be displayed in the file system. The following special characters are not allowed: "/", "\", "?", "%", "*", ":", "|", """, "<", ">", "$", "'".
fr: Le nom du répertoire du projet tel qu'il sera défini dans le système de fichiers. Les caractères spéciaux suivants ne sont pas autorisés : "/", "\", "?", "%", "*", ":", "|", """, "<", ">", "$", "'".

source: The room %s cannot be chosen as the exam "%s" is currently being conducted. Please make sure that the exam is finished via the module "Computer room" before a new exam can be started again.
fr: La salle %s ne peut pas être choisie, car l'examen « %s » y est actuellement conduit. Veuillez vous assurer que l'examen est terminé par le biais du module « Salle informatique » afin qu'un nouvel examen puisse commencer à nouveau.

source: The time when the exam ends
fr: L'heure à laquelle l'examen se termine

source: This computer room is currently in use by %s.
fr: Cette salle informatique est actuellement utilisée par %s.

source: This computer room is currently in use by %s. You can take control over the room, however, the current teacher will be prompted a notification and its session will be closed.
fr: Cette salle informatique est actuellement utilisée par %s. Vous pouvez prendre le contrôle sur la salle, mais le professeur actuel recevra une notification et sa session sera fermée.

source: Upload files
fr: Envoyer des fichiers

source: Upload of exam files
fr: Envoyer des fichiers d'examen

source: User
fr: Utilisateur

source: Web access profile
fr: Profil d'accès au Web

source: pending
fr: en attente

source: started
fr: démarré
