Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-exam/umc/python/schoolexam/*.po
Languages: fr

source: An exam with the name "%s" already exists. Please choose a different name for the exam.
fr: Un examen nommé « %s » existe déjà. Veuillez choisir un autre nom pour cet examen.

source: An unexpected error occurred during the preparation: %s
fr: Une erreur inattendue est survenue lors de la préparation : %s

source: Collecting exam files...
fr: Collecte des fichiers des examens...

source: Configuring the computer room...
fr: Configuration de la salle informatique...

source: Could not authenticate user "%s"!
fr: Impossible d'authentifier l'utilisateur « %s » !

source: Could not connect to Primary Directory Node %s.
fr: Impossible de se connecter au Primary Directory Node %s.

source: Distributing exam files
fr: Distribution des fichiers d'examen

source: Error loading group DN {!r}.
fr: Erreur lors du chargement du groupe DN {!r}.

source: Exam details are only visible to the exam owner himself.
fr: Les détails de l’examen ne sont visibles que par son propriétaire.

source: Initializing
fr: Initialisation

source: No files have been distributed
fr: Aucun fichier n'a été distribué

source: Prepare room settings
fr: Préparer la configuration de la salle

source: Preparing exam accounts
fr: Préparation des comptes d'examen

source: Preparing the computer room for exam mode...
fr: Préparation de la salle informatique pour le mode examen...

source: Preparing user home directories
fr: Préparation des répertoires personnels des utilisateurs

source: Removing exam accounts
fr: Suppression des comptes de l'examen

source: Replication timeout: could not create all exam users
fr: Délai de réplication dépassé : impossible de créer tous les utilisateurs de l'examen

source: Room "%s" does not contain any computers. Empty rooms may not be used to start an exam.
fr: La salle « %s » ne contient pas d'ordinateur. Les salles vides ne peuvent pas être employées pour démarrer un examen.

source: The exam can only be modified by the owner himself.
fr: L’examen ne peut être modifié que par son propriétaire.

source: The exam was already started and can not be modified anymore!
fr: L’examen a déjà commencé et ne peut plus être modifié !

source: The specified exam does not exist: %s
fr: L’examen spécifié n’existe pas : %s

source: finished...
fr: terminé...
