Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-exam/umc/python/schoolexam-master/*.po
Languages: fr

source: Could not remove exam role "%s" from %s: %s
fr: Impossible de supprimer le rôle d’examen « %s » de %s : %s

source: Could not remove exam user %(userdn)r: %(exc)s
fr: Impossible de supprimer la ou le participant·e à l’examen %(userdn)r : %(exc)s

source: ERROR: Creation of exam user account failed %s
fr: ERREUR : échec de création du compte utilisateur pour l'examen %s

source: Exam for user %s
fr: Examen pour l'utilisateur %s

source: Exam student %r not found.
fr: Étudiant %r pour l'examen non trouvé.

source: Exam user %(exam_user_uid)r not found.
fr: Participant·e à l’examen %(exam_user_uid)r introuvable.

source: ExamStudent %(exam_user_dn)r added to LDAP but cannot be loaded: %(exc)r.
fr: ExamStudent %(exam_user_dn)r ajouté à LDAP mais impossible à charger : %(exc)r.

source: Failed to create exam container %s
fr: Impossible de créer le conteneur d'examen %s

source: Failed to create exam group %s
fr: Impossible de créer le groupe d'examen %s

source: Requested exam username %(exam_user_uid)s is not allowed according to settings/prohibited_username object %(prohibited_object_name)s
fr: L’identifiant d’examen %(exam_user_uid)s demandé n’est pas autorisé selon l’objet « settings/prohibited_username » %(prohibited_object_name)s

source: Student %(user_dn)r not found: %(exc)r.
fr: Élève %(user_dn)r introuvable : %(exc)r.

source: Student %r not found.
fr: Étudiant %r non trouvé.
