Repository: openfnord/ucs-school
Catalog: ucs-school-umc-groups/umc/*.po
Languages: de

source: Add and modify workgroups
de: Anlegen und Bearbeiten von Arbeitsgruppen

source: Add and modify organizational groups
de: Anlegen und Bearbeiten von organisatorischen Gruppen

source: Administrate workgroups
de: Arbeitsgruppen verwalten

source: Administrate organizational groups
de: Organisatorische Gruppen verwalten

source: Edit members of workgroups
de: Bearbeiten der Mitglieder einer Arbeitsgruppe

source: Edit workgroups
de: Arbeitsgruppen bearbeiten

source: Assigning teachers
de: Lehrer zuordnen

source: Associate teachers with a class
de: Zuweisen von Lehrern zu einer Klasse

source: Assigning classes
de: Klassen zuordnen

source: Associate classes with a teacher
de: Zuweisen von Klassen zu einem Lehrer
