Repository: openfnord/ucs-school
Catalog: ucs-school-umc-computerroom/umc/js/*.po
Languages: de

source: %s minutes left
de: %s Minuten verbleiben

source: 1 minute left
de: 1 Minute verbleibt

source: <b>At least one web site is required!</b>
de: <b>Mindestens eine Webseite muss angegeben werden!</b>

source: <b>Note:</b> In this computer room the exam "%s" is currently being conducted by %s.
de: <b>Hinweis:</b> In diesem Computerraum wird momentan die Klassenarbeit "%s" von %s durchgeführt.

source: <b>Note:</b> In this computer room the exam "%s" is currently being written.
de: <b>Hinweis:</b> In diesem Computerraum wird momentan die Klassenarbeit %s geschrieben.

source: <b>Note:</b> This computer room is currently in use by %s.
de: <b>Hinweis:</b> Der Computerraum wird momentan verwendet von %s.

source: <p><b>Note:</b> All computers need to be either switched off or rebooted before they can be used again for regular schooling.</p>
de: <p><b>Hinweis:</b> Alle Rechner müssen entweder ausgeschaltet oder neu gestartet werden bevor sie wieder für den regulären Schulbetrieb verwendet werden können.</p>

source: <p>In this text box you can list web sites that are allowed to be used by the students. Each line should contain one web site. Example: </p><p style="font-family: monospace">univention.com<br/>wikipedia.org<br/></p>
de: <p>In diesem Textfeld können die Webseiten eingetragen werden, die von den Schülern besucht werden dürfen. Pro Zeile ist eine Webseite einzutragen. Beispiel: </p><p style="font-family: monospace">univention.de<br/>wikipedia.org<br/></p>

source: <p>Please confirm to collect students' exam files.</p><p>This files will be stored in the corresponding exam folder of your home directory. It is possible to collect exam files several times during an exam.</p>
de: <p>Bitte bestätigen Sie das Einsammeln der Klassenarbeitsdokumente.</p><p>Die Dokumente werden in dem zugehörigen Klassenarbeitsverzeichnis unterhalb Ihres Heimatverzeichnisses abgelegt. Es ist möglich die Dokumente während einer Klassenarbeit mehrmals einzusammeln.</p>

source: <p>Please confirm to irrevocably finish the current exam.</p><p>All corresponding exam files will be collected from the students' home directories and stored in the corresponding exam folder of your home directory.</p>
de: <p>Bitte bestätigen Sie das unwiderrufliche Beenden der aktuellen Klassenarbeit.</p><p>Alle zugehörigen Klassenarbeitsdokumente werden aus den Schülerheimatverzeichnissen eingesammelt und in dem entsprechenden Klassenarbeitsverzeichnis unterhalb Ihres Heimatverzeichnisses abgelegt.<p>

source: <p>The exam has been successfully finished. All related exam documents have been collected from the students' home directories.</p>
de: <p>Die Klassenarbeit wurde erfolgreich beendet. Alle zugehörigen Dokumente wurden aus den Schülerheimatverzeichnissen eingesammelt.</p>

source: All computers in this room are offline.
de: Alle Computer in diesem Raum sind offline.

source: All related exam documents have been collected successfully from the students' home directories.
de: Alle zugehörigen Klassenarbeitsdokumente wurden erfolgreich aus den Heimatverzeichnissen der Schüler eingesammelt.

source: Back to overview
de: Zurück zur Übersicht

source: Cancel
de: Abbrechen

source: Change room
de: Raum wechseln

source: Change settings
de: Einstellungen ändern

source: Choose the computer room to monitor
de: Wähle den zu beaufsichtigenden Computerraum

source: Choose the school
de: Auswahl der Schule

source: Close exam mode
de: Klassenarbeitsmodus schließen

source: Close module
de: Modul schließen

source: Collect results
de: Ergebnisse einsammeln

source: Computer room
de: Computerraum

source: Computer room: %s
de: Computerraum: %s

source: Computer type
de: Computertyp

source: Continue without finishing
de: Ohne Beenden fortfahren

source: Control over the computer room has been taken by "%s", your session has been closed. In case this behaviour was not intended, please contact the other user. You can regain control over the computer room, by choosing it from the list of rooms again.
de: Die Kontrolle des Raumes wurde übernommen durch "%s", Ihre Sitzung wurde daher geschlossen. Sollte dieses Verhalten nicht beabsichtigt gewesen sein, setzen Sie sich bitte mit dem anderen Benutzer in Verbindung. Sie können die Kontrolle des Raumes wieder übernehmen, indem Sie ihn in der Liste aller Räume erneut auswählen.

source: Currently there is no screenshot available. Wait a few seconds.
de: Derzeit ist kein Screenshot verfügbar. Bitte einige Sekunden warten.

source: Default (global settings)
de: Standard (globale Einstellungen)

source: Default (no restrictions)
de: Standard (keine Einschränkungen)

source: Defines restriction for the share access
de: Definiert Einschränkungen für den Zugriff auf Freigaben

source: Do not remind again
de: Nicht mehr erinnern

source: Do you really want to close the exam mode? FINISH EXAM finishes the exam and the results of all participants will be copied into your home directory. CONTINUE WITHOUT FINISHING closes the tab and the exam continues. By opening the computeroom module again you can return to the exam mode. Please do not forget to finish the exam at a later time.
de: Möchten Sie den Klassenarbeitsmodus wirklich schließen? KLASSENARBEIT BEENDEN beendet die Klassenarbeit und alle Ergebnisse der Prüfungsteilnehmer werden in den Ordner Ihres Heimatverzeichnisses kopiert. OHNE BEENDEN FORTFAHREN schließt den TAB und der Klassenarbeitsmodus wird fortgesetzt. Durch Öffnen des Computerraum-Moduls gelangen Sie zurück zum Klassenarbeitsmodus. Bitte vergessen Sie in dem Fall nicht die Klassenarbeit später zu beenden.

source: Do you want to create a computer room now or close the module?
de: Möchten Sie jetzt einen Computerraum anlegen oder das Modul schließen?

source: Exam files only
de: Nur Prüfungsdateien

source: Exam mode - %s
de: Klassenarbeitsmodus - %s

source: Failed to open a new session for the room.
de: Eine neue Sitzung für den Raum konnte nicht geöffnet werden.

source: Finish exam
de: Klassenarbeit beenden

source: Finishing exam...
de: Beenden der Klassenarbeit...

source: Here you can watch the students' computers, lock the computers, show presentations, control the internet access and define the available printers and shares.
de: Hier können Sie die Computer der Schüler beaufsichtigen, den Zugang zum Computer sperren, Präsentationen zeigen, den Internetzugang kontrollieren und den Zugriff auf Drucker und Freigaben festlegen.

source: IP address
de: IP-Adresse

source: Large
de: Groß

source: List of allowed web sites for "{myRules}"
de: Liste erlaubter Webseiten für "{myRules}"

source: Lock input devices
de: Eingabegeräte sperren

source: Lock screen
de: Bildschirm sperren

source: Logout user
de: Benutzer abmelden

source: Lost the connection to the computer room. Please try to reopen the computer room.
de: Verbindung zum Computerraum unterbrochen. Bitte versuchen Sie, den Computerraum erneut zu öffnen.

source: MAC address
de: MAC-Adresse

source: Manage computer rooms
de: Computerräume verwalten

source: Monitoring is activated
de: Beaufsichtigung ist aktiviert

source: No computers were selected. Please select computers.
de: Keine Computer wurden ausgewählt. Bitte Computer auswählen.

source: No room selected
de: Kein Raum ausgewählt

source: No user logged in
de: Kein Benutzer angemeldet

source: Only own home directory
de: Nur eigenes Heimatverzeichnis

source: Personal internet rules
de: Eigene Internetregeln

source: Personal settings for the computer room
de: Benutzerdefinierte Einstellungen für den Computerraum

source: Please contact your system administrator for the creation of computer rooms.
de: Bitte kontaktieren Sie ihren Systemadministrator für das Anlegen von Computerräumen.

source: Please wait while all exam documents are being collected.
de: Alle Klassenarbeitsdokumente werden eingesammelt.

source: Presentation
de: Präsentation

source: Print mode
de: Druckmodus

source: Printing deactivated
de: Drucken deaktiviert

source: Remind
de: Erinnerung

source: Remind again
de: Erneut erinnern

source: Reset
de: Zurücksetzen

source: Restart computer
de: Computer neu starten

source: School
de: Schule

source: Screenshots of computers
de: Bildschirmfotos der Computer

source: Select computer room
de: Computerraum auswählen

source: Select room
de: Raum auswählen

source: Set
de: Setzen

source: Share access
de: Freigabezugriff

source: Shutdown computer
de: Computer herunterfahren

source: Size
de: Größe

source: Small
de: Klein

source: Start presentation
de: Präsentation starten

source: Stop presentation
de: Präsentation beenden

source: Switch on computer
de: Computer einschalten

source: Take over
de: Übernehmen

source: The allowed time for this examination has been reached. The exam can now be extended or collected. Should be reminded again in 5 minutes?
de: Die vorgesehene Zeit der Klassenarbeit wurde erreicht. Die Klassenarbeit kann nun verlängert oder eingesammelt werden. Soll in 5 Minuten erneut erinnert werden?

source: The computer is currently participating in a presentation
de: Der Computer nimmt momentan an einer Präsentation teil

source: The computer is currently showing a presentation
de: Der Computer zeigt momentan eine Präsentation

source: The computer is not running
de: Der Computer läuft aktuell nicht

source: The computer is unreachable because no IP address has been assigned to the computer object.
de: Der Computer kann nicht erreicht werden, weil dem Computer-Objekt keine IP-Adresse zugewiesen ist.

source: The monitoring mode has failed. It seems that the monitoring service is not configured properly.
de: Die Beaufsichtigung ist fehlgeschlagen. Scheinbar ist der Beaufsichtigungsdienst nicht korrekt konfiguriert.

source: The monitoring mode has failed. Maybe the service is not installed or the Firewall is active.
de: Die Beaufsichtigung ist fehlgeschlagen. Entweder ist der Dienst nicht installiert oder die Firewall ist aktiv.

source: The presentation is starting. This may take a few moments. When the presentation server is started a column presentation is shown that contains a button 'Stop' to end the presentation.
de: Die Präsentation wird gestartet. Dies kann einen Moment dauern. Wenn der Präsentationsserver gestartet ist wird eine Spalte Präsentation angezeigt, die eine Schaltfläche 'Beenden' enthält um die Präsentation zu stoppen.

source: The presentation will stop now.
de: Die Präsentation wird nun gestoppt.

source: The room is empty or the computers are not configured correctly. Please select another room.
de: Der Raum ist leer oder die Computer sind nicht korrekt eingerichtet. Bitte wählen Sie einen anderen Raum.

source: The selected computers are being locked.
de: Die ausgewählten Computer werden gesperrt.

source: The selected computers are being unlocked.
de: Die ausgewählten Computer werden entsperrt.

source: The selected computers are booting up.
de: Die ausgewählten Computer fahren hoch.

source: The selected computers are rebooting.
de: Die ausgewählten Computer starten neu.

source: The selected computers are shutting down.
de: Die ausgewählten Computer fahren herunter.

source: The selected users are logging off.
de: Die ausgewählten Benutzer werden ausgeloggt.

source: There are no computer rooms available
de: Es sind keine Computerräume verfügbar

source: There is no exam running in this room anymore. It seems like the exam was finished properly from somewhere else.
de: In diesem Raum läuft gerade keine Klassenarbeit mehr. Es hat den Anschein, als wurde die Klassenarbeit von anderer Stelle aus beendet.

source: This computer room is currently in use by %s. You can take control over the room, however, the current teacher will be prompted a notification and its session will be closed.
de: Dieser Computerraum wird derzeit verwendet von %s. Sie können die Kontrolle des Raums übernehmen, dazu wird dem momentanen Lehrer ein Hinweis angezeigt und seine Sitzung geschlossen.

source: This page shows screenshots of selected computers that will be updated continuously.
de: Diese Seite zeigt Bildschirmfotos der ausgewählten Computer die fortlaufend aktualisiert werden.

source: Time is up
de: Zeit ist abgelaufen

source: Tiny
de: Winzig

source: Unknown
de: Unbekannt

source: Unlock input devices
de: Eingabegeräte entsperren

source: Unlock screen
de: Bildschirm entsperren

source: User
de: Benutzer

source: Valid until
de: Gültig bis

source: Watch
de: Beobachten

source: Web access profile
de: Internetregeln

source: screenshot_notready.svg
de: screenshot_notready_de.svg

source: {0} computers are in this room
de: {0} Computer befinden sich im Raum

source: {0} powered off/misconfigured
de: {0} ausgeschaltet/nicht konfiguriert

source: {time} minutes
de: {time} Minuten
