Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-computerroom/umc/js/*.po
Languages: fr

source: %s minutes left
fr: %s minutes restantes

source: 1 minute left
fr: Une minute restante

source: <b>At least one web site is required!</b>
fr: <b>Au moins un site Web est requis !</b>

source: <b>Note:</b> In this computer room the exam "%s" is currently being conducted by %s.
fr: <b>Remarque :</b> dans cette salle informatique, l'examen « %s » est conduit par %s.

source: <b>Note:</b> In this computer room the exam "%s" is currently being written.
fr: <b>Remarque :</b> dans cette salle informatique, l'examen « %s » est actuellement écrit.

source: <b>Note:</b> This computer room is currently in use by %s.
fr: <b>Remarque :</b> cette salle informatique est actuellement utilisée par %s.

source: <p><b>Note:</b> All computers need to be either switched off or rebooted before they can be used again for regular schooling.</p>
fr: <p><b>Remarque :</b> Tous les ordinateurs doivent être éteints ou redémarrés avant de pouvoir être à nouveau utilisés pour l’enseignement habituel.</p>

source: <p>In this text box you can list web sites that are allowed to be used by the students. Each line should contain one web site. Example: </p><p style="font-family: monospace">univention.com<br/>wikipedia.org<br/></p>
fr: <p>Vous pouvez énumérer dans cette boîte de texte les sites Web que les étudiants peuvent utiliser. Chaque ligne doit contenir un site Web. Exemple : </p><p style="font-family: monospace">univention.com<br/>wikipedia.org<br/></p>

source: <p>Please confirm to collect students' exam files.</p><p>This files will be stored in the corresponding exam folder of your home directory. It is possible to collect exam files several times during an exam.</p>
fr: <p>Veuillez confirmer la collecte des fichiers d'examen des étudiants.</p><p>Ces fichiers seront stockés dans un dossier correspondant à l'examen dans votre répertoire personnel. Il est possible de collecter les fichiers d'examen à plusieurs reprises au cours de l'examen.</p>

source: <p>Please confirm to irrevocably finish the current exam.</p><p>All corresponding exam files will be collected from the students' home directories and stored in the corresponding exam folder of your home directory.</p>
fr: <p>Veuillez confirmer la fin irrévocable de l'examen en cours.</p><p>Tous les fichiers correspondants à l'examen seront collectés depuis les répertoires personnels des étudiants et stockés dans le dossier correspondant à l'examen dans votre répertoire personnel.</p>

source: <p>The exam has been successfully finished. All related exam documents have been collected from the students' home directories.</p>
fr: <p>L’examen s'est terminé avec succès. Tous les documents liés à l’examen ont été collectés depuis les répertoires personnels des élèves.</p>

source: All computers in this room are offline.
fr: Tous les ordinateurs de cette salle sont hors ligne.

source: All related exam documents have been collected successfully from the students' home directories.
fr: Tous les documents liés à l'examen ont été collectés avec succès depuis les répertoires personnels des étudiants.

source: Back to overview
fr: Retour vers la vue globale

source: Cancel
fr: Annuler

source: Change room
fr: Modifier la salle

source: Change settings
fr: Modifier les réglages

source: Choose the computer room to monitor
fr: Choisissez la salle informatique à surveiller

source: Choose the school
fr: Choisissez l'école

source: Close exam mode
fr: Fermer le mode examen

source: Close module
fr: Fermer le module

source: Collect results
fr: Collecter les résultats

source: Computer room
fr: Salle informatique

source: Computer room: %s
fr: Salle informatique : %s

source: Computer type
fr: Type d'ordinateur

source: Continue without finishing
fr: Continuer sans conclure

source: Control over the computer room has been taken by "%s", your session has been closed. In case this behaviour was not intended, please contact the other user. You can regain control over the computer room, by choosing it from the list of rooms again.
fr: Le contrôle de cette salle informatique a été pris par « %s »., votre session a été fermée. Dans le cas où cette action n'était pas volontaire, veuillez contacter l'autre utilisateur. Vous pouvez reprendre le contrôle sur cette salle informatique en la sélectionnant à nouveau depuis la liste des salles.

source: Currently there is no screenshot available. Wait a few seconds.
fr: Aucune capture d'écran n'est disponible actuellement. Veuillez patienter quelques secondes.

source: Default (global settings)
fr: Par défaut (configuration générale)

source: Default (no restrictions)
fr: Par défaut (pas de restrictions)

source: Defines restriction for the share access
fr: Définit les restrictions sur l'accès au partage

source: Do not remind again
fr: Ne pas me le rappeler

source: Do you really want to close the exam mode? FINISH EXAM finishes the exam and the results of all participants will be copied into your home directory. CONTINUE WITHOUT FINISHING closes the tab and the exam continues. By opening the computeroom module again you can return to the exam mode. Please do not forget to finish the exam at a later time.
fr: Voulez-vous vraiment fermer le mode examen ? CONLURE L’EXAMEN termine l’examen et les résultats des participant·es seront copiés dans votre répertoire personnel. CONTINUER SANS CONCLURE ferme l’onglet et l’examen continue. En ouvrant à nouveau le module « Salle informatique », vous pourrez revenir au mode examen. N’oubliez pas de terminer l’examen plus tard.

source: Do you want to create a computer room now or close the module?
fr: Voulez-vous créer une salle informatique maintenant ou fermer le module ?

source: Exam files only
fr: Fichiers d’examen uniquement

source: Exam mode - %s
fr: Mode examen - %s

source: Failed to open a new session for the room.
fr: Échec de l'ouverture d'une nouvelle session pour cette salle.

source: Finish exam
fr: Conclure l'examen

source: Finishing exam...
fr: Conclusion de l'examen...

source: Here you can watch the students' computers, lock the computers, show presentations, control the internet access and define the available printers and shares.
fr: Vous pouvez ici surveiller les ordinateurs des étudiants, verrouiller les ordinateurs, afficher des présentations, contrôler l'accès à Internet et définir les imprimantes et les partages disponibles.

source: IP address
fr: Adresse IP

source: Large
fr: Grand

source: List of allowed web sites for "{myRules}"
fr: Liste des sites Internet autorisés pour "{myRules}"

source: Lock input devices
fr: Verrouiller les périphériques d'entrée

source: Lock screen
fr: Verrouiller l'écran

source: Logout user
fr: Déconnecter l'utilisateur

source: Lost the connection to the computer room. Please try to reopen the computer room.
fr: La connexion à cette salle informatique a été perdue. Veuillez essayer d'ouvrir la salle informatique à nouveau.

source: MAC address
fr: Adresse MAC

source: Manage computer rooms
fr: Gérer les salles informatiques

source: Monitoring is activated
fr: La surveillance est activée

source: Name
fr: Nom

source: No computers were selected. Please select computers.
fr: Aucun ordinateur sélectionné. Veuillez sélectionner des ordinateurs.

source: No room selected
fr: Aucune salle sélectionnée

source: No user logged in
fr: Personne n’est connecté

source: Ok
fr: Valider

source: Only own home directory
fr: Répertoire personnel uniquement

source: Personal internet rules
fr: Règles Internet personnelles

source: Personal settings for the computer room
fr: Réglages personnels pour cette salle informatique

source: Please contact your system administrator for the creation of computer rooms.
fr: Veuillez contacter votre administrateur ou administratrice système pour la création de salles informatiques.

source: Please wait while all exam documents are being collected.
fr: Veuillez patienter pendant que tous les documents de l'examen sont collectés.

source: Presentation
fr: Présentation

source: Print mode
fr: Mode d'impression

source: Printing deactivated
fr: Impression désactivée

source: Remind
fr: Rappeler

source: Remind again
fr: Rappeler à nouveau

source: Reset
fr: Réinitialiser

source: Restart computer
fr: Redémarrer l'ordinateur

source: School
fr: École

source: Screenshots of computers
fr: Captures d'écran des ordinateurs

source: Select computer room
fr: Sélectionnez la salle informatique

source: Select room
fr: Sélectionnez la salle

source: Set
fr: Définir

source: Share access
fr: Partager l'accès

source: Shutdown computer
fr: Éteindre l'ordinateur

source: Size
fr: Taille

source: Small
fr: Petit

source: Start presentation
fr: Démarrer la présentation

source: Status
fr: État

source: Stop presentation
fr: Arrêter la présentation

source: Switch on computer
fr: Démarrer l'ordinateur

source: Take over
fr: Prendre la main

source: The allowed time for this examination has been reached. The exam can now be extended or collected. Should be reminded again in 5 minutes?
fr: Le temps imparti pour l'examen a été atteint. L'examen peut maintenant être étendu ou collecté. Doit-on vous le rappeler à nouveau dans 5 minutes ?

source: The computer is currently participating in a presentation
fr: L'ordinateur participe actuellement à une présentation

source: The computer is currently showing a presentation
fr: L'ordinateur affiche actuellement une présentation

source: The computer is not running
fr: L'ordinateur n'est pas démarré

source: The monitoring mode has failed. It seems that the monitoring service is not configured properly.
fr: Le mode de surveillance a échoué. Il semble que le service de surveillance ne soit pas configuré correctement.

source: The monitoring mode has failed. Maybe the service is not installed or the Firewall is active.
fr: Le mode de surveillance a échoué. Le service n'est peut-être pas installé, ou le pare-feu est actif.

source: The presentation is starting. This may take a few moments. When the presentation server is started a column presentation is shown that contains a button 'Stop' to end the presentation.
fr: La présentation a démarré. Ceci peut prendre un certain temps. Lorsque le serveur de présentation est démarré, une colonne de présentation est affichée, et définit un bouton « Arrêter » pour terminer la présentation.

source: The presentation will stop now.
fr: La présentation va maintenant se terminer.

source: The room is empty or the computers are not configured correctly. Please select another room.
fr: La salle est vide ou les ordinateurs ne sont pas configurés convenablement. Veuillez sélectionner une autre salle.

source: The selected computers are being locked.
fr: Les ordinateurs sélectionnés sont verrouillés.

source: The selected computers are being unlocked.
fr: Les ordinateurs sélectionnés sont déverrouillés.

source: The selected computers are booting up.
fr: Les ordinateurs sélectionnés sont en train de démarrer.

source: The selected computers are rebooting.
fr: Les ordinateurs sélectionnés sont en train de redémarrer.

source: The selected computers are shutting down.
fr: Les ordinateurs sélectionnés sont en train de s'arrêter.

source: The selected users are logging off.
fr: Les utilisateurs sélectionnés se déconnectent.

source: There are no computer rooms available
fr: Aucune salle informatique disponible

source: There is no exam running in this room anymore. It seems like the exam was finished properly from somewhere else.
fr: Il n’y a plus d’examen en cours dans cette salle. L’examen semble avoir été conclu correctement depuis un autre endroit.

source: This computer room is currently in use by %s. You can take control over the room, however, the current teacher will be prompted a notification and its session will be closed.
fr: Cette salle informatique est actuellement utilisée par %s. Vous pouvez prendre le contrôle sur la salle, mais le professeur actuel recevra une notification et sa session sera fermée.

source: This page shows screenshots of selected computers that will be updated continuously.
fr: Cette page affiche des captures d'écran des ordinateurs sélectionnés et celles-ci seront actualisées en continu.

source: Time is up
fr: Fin du temps imparti

source: Tiny
fr: Minuscule

source: Unknown
fr: Inconnu

source: Unlock input devices
fr: Déverrouiller les périphériques d'entrée

source: Unlock screen
fr: Déverrouiller l'écran

source: User
fr: Utilisateur

source: Valid until
fr: Valable jusque

source: Watch
fr: Surveiller

source: Web access profile
fr: Profil d'accès au Web

source: {0} computers are in this room
fr: {0} ordinateurs sont dans cette salle

source: {0} powered off/misconfigured
fr: {0} éteints / mal configurés
