Repository: openfnord/ucs-school
Catalog: doc/ucsschool-changelog/locales/*/LC_MESSAGES/changelog.po
Languages: de

source: Released on 2023-06-21
de: Veröffentlicht am 21. Juni 2023

source: Source package *ucs-school-selfservice-support* in version ``4.0.3``:
de: Quellpaket *ucs-school-selfservice-support* in Version ``4.0.3``:

source: The "Change password" option is now automatically available for every school user (:uv:bug:`55864`).
de: Die Option "Passwort ändern" ist jetzt automatisch für jeden Schulbenutzer verfügbar (:uv:bug:`55864`).

source: Source package *ucs-school-lib* in version ``13.0.37``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.37``:

source: Added a UCR variable ``ucsschool/stop_notifier`` to configure stopping the notifier during imports (:uv:bug:`54228`).
de: Eine UCR-Variable ``ucsschool/stop_notifier`` wurde hinzugefügt, um das Stoppen des Notifier während des Imports zu konfigurieren (:uv:bug:`54228`).

source: Released on 2023-06-07
de: Veröffentlicht am 7. Juni 2023

source: Source package *ucs-school-umc-exam* in version ``10.0.9``:
de: Quellpaket *ucs-school-umc-exam* in Version ``10.0.9``:

source: Fix: The process of creating exam users could fail due to an unsuccessful SID acquisition (:uv:bug:`54848`).
de: Fix: Der Prozess der Erstellung von Klassenarbeitsbenutzern konnte aufgrund einer fehlgeschlagenen ``SID acquisition`` fehlschlagen (:uv:bug:`54848`).

source: Released on 2023-05-24
de: Veröffentlicht am 24. Mai 2023

source: Source package *ucs-school-umc-users* in version ``16.0.7A~5.0.0.202304250918``:
de: Quellpaket *ucs-school-umc-users* in Version ``16.0.7A~5.0.0.202304250918``:

source: The coding style has been improved (:uv:bug:`55751`).
de: Der Formatierungsstil wurde verbessert (:uv:bug:`55751`).

source: Typos in name field description for German have been fixed (:uv:bug:`55773`).
de: Tippfehler in der Beschreibung des Namensfeldes für Deutsch wurden behoben (:uv:bug:`55773`).

source: Source package *ucs-school-umc-printermoderation* in version ``17.1.3A~5.0.0.202304250916``:
de: Quellpaket *ucs-school-printermoderation* in Version ``17.1.3A~5.0.0.202304250916``:

source: Source package *ucs-school-umc-lists* in version ``3.0.8``:
de: Quellpaket *ucs-school-umc-lists* in Version ``3.0.8``:

source: Class lists can be downloaded in Firefox again while the module is opened in an iframe (UCS portal) (:uv:bug:`55102`).
de: Klassenlisten können in Firefox wieder heruntergeladen werden, während das Modul in einem iframe geöffnet ist (UCS-Portal) (:uv:bug:`55102`).

source: Source package *ucs-school-umc-groups* in version ``10.0.9A~5.0.0.202305111046``:
de: Quellpaket *ucs-school-umc-groups* in Version ``10.0.9A~5.0.0.202305111046``:

source: Fixed a problem where the modal to add "Members", "Teachers" and "Classes" in the "Administrate workgroups", "Administrate teachers" and "Administrate classes" UCS@school UMC modules respectively would show objects of a different school than selected (:uv:bug:`55990`).
de: Es wurde ein Problem behoben, bei dem das Modal zum Hinzufügen von "Mitgliedern", "Lehrern" und "Klassen" in den UMC-Modulen "Arbeitsgruppen verwalten", "Lehrer verwalten" und "Klassen verwalten" von UCS@school Objekten eine andere als der ausgewählten Schule anzeigt wurde (:uv:bug:`55990`).

source: Source package *ucs-school-lib* in version ``13.0.36A~5.0.0.202305031536``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.36A~5.0.0.202305031536``:

source: Validate usernames to avoid Windows reserved names (:uv:bug:`53519`).
de: Nutzernamen werden validiert um reservierte Windows-Namen zu vermeiden (:uv:bug:`53519`).

source: Removing admin from a school removes them from the correct admin group (:uv:bug:`55986`).
de: Wenn ein Administrator aus einer Schule entfernt wird, wird er aus der richtigen Administratorgruppe entfernt (:uv:bug:`55986`).

source: Source package *ucs-school-import* in version ``18.0.32``:
de: Quellpaket *ucs-school-import* in Version ``18.0.32``:

source: Support setting multiple nested settings for the importer (:uv:bug:`56041`).
de: Unterstützung verschachtelter Einstellungen für den Importer (:uv:bug:`56041`).

source: Make columns and lines configurable in log output (:uv:bug:`53734`).
de: Spalten und Zeilen in der Protokollausgabe konfigurierbar machen (:uv:bug:`53734`).

source: Released on 2023-03-27
de: Veröffentlicht am 27. März 2023

source: Source package *ucs-school-lib* in version ``13.0.33A~5.0.0.202303141409``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.33A~5.0.0.202303141409``:

source: Colons can now be used in exam names (:uv:bug:`55768`).
de: Doppelpunkte können nun für Klassenarbeitsnamen verwendet werden (:uv:bug:`55768`).

source: Source package *ucs-school-import* in version ``18.0.30A~5.0.0.202303091544``:
de: Quellpaket *ucs-school-import* in Version ``18.0.30A~5.0.0.202303091544``:

source: When passing nested command line arguments like ``output`` for ``ucs-school- user-import``, only the last one was used. This has been fixed (:uv:bug:`53632`).
de: Bei der Übergabe von verschachtelten Kommandozeilenargumenten wie ``output`` für ``ucs-school-user-import`` wurde nur das letzte verwendet. Dies wurde nun behoben (:uv:bug:`53632`).

source: Released on 2023-02-23
de: Veröffentlicht am 23. Februar 2023

source: Source package *ucs-school-umc-exam* in version ``10.0.8A~5.0.0.202302211433``:
de: Quellpaket *ucs-school-umc-exam* in Version ``10.0.8A~5.0.0.202302211433``:

source: Prevent ``exam-exam-`` users from being created. (:uv:bug:`55619`).
de: Verhindere die Erstellung von ``exam-exam-`` Benutzern. (:uv:bug:`55619`).

source: Released on 2023-01-19
de: Veröffentlicht am 19. Januar 2023

source: Source package *ucs-school-umc-diagnostic* in version ``2.0.12A~5.0.0.202301161803``:
de: Quellpaket *ucs-school-umc-diagnostic* in Version ``2.0.12A~5.0.0.202301161803``:

source: Updated the terminology to replication and primary directory node (:uv:bug:`55557`).
de: Die Terminologie wurde an Replication und Primary Directory Node angepasst (:uv:bug:`55557`).

source: Source package *ucs-school-lib* in version ``13.0.31A~5.0.0.202212070852``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.31A~5.0.0.202212070852``:

source: Internal bug fix: More DNs are now compared case insensitive (:uv:bug:`55455`).
de: Intern: Mehr DNs werden ohne Berücksichtigung der Groß- und Kleinschreibung verglichen (:uv:bug:`55455`).

source: Source package *ucs-school-import* in version ``18.0.28A~5.0.0.202301121201``:
de: Quellpaket *ucs-school-import* in Version ``18.0.28A~5.0.0.202301121201``:

source: Allow executing python import hooks during the script ``import_computer``. Learn more about the implementation of this type of hook in the `UCS@school Administrators manual <https://docs.software-univention.de/ucsschool- manual/5.0/de/manage-school-imports.html#skriptbasierter-import-von-pcs>`_ (:uv:bug:`55014`).
de: Erlaube das Ausführen von Python Import Hooks während des Skripts ``import_computer``. Mehr Informationen über die Implementierung dieser Art von Hooks findet sich im `UCS@school Administrator Handbuch <https://docs.software-univention.de/ucsschool- manual/5.0/de/manage-school-imports.html#skriptbasierter-import-von-pcs>`_ (:uv:bug:`55014`).

source: Internal bug fix: More OU names are now compared case insensitive (:uv:bug:`55455`).
de: Intern: Mehr Schulnamen werden ohne Berücksichtigung der Groß- und Kleinschreibung verglichen (:uv:bug:`55455`).

source: Released on 2022-11-17
de: Veröffentlicht am 17. November 2022

source: Source package *ucs-school-umc-wizards* in version ``12.0.12A~5.0.0.202211150913``:
de: Quellpaket *ucs-school-umc-wizards* in Version ``12.0.12A~5.0.0.202211150913``:

source: The evaluation of password policies during the creation of new users in the UMC can now be enabled by setting the UCR Variable ``ucsschool/wizards/schoolwizards/users/check-password-policies``. It is disabled by default (:uv:bug:`55415`).
de: Die Evaluierung von Passwort Richtlinien während des Erstellens von neuen Benutzern in der UMC kann jetzt über die UCR-Variable ``ucsschool/wizards/schoolwizards/users/check-password-policies`` aktiviert werden. Sie ist standardmäßig deaktiviert (:uv:bug:`55415`).

source: Source package *ucs-school-lib* in version ``13.0.30A~5.0.0.202211151535``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.30A~5.0.0.202211151535``:

source: |UCSUAS| users now might be created with context types, which are unknown to the |UCSUAS| library (:uv:bug:`55355`).
de: |UCSUAS| Benutzer können jetzt mit Kontexttypen erstellt werden, die nicht von der |UCSUAS| Bibliothek gesetzt werden (:uv:bug:`55355`).

source: Internal: Added an option to evaluate password policies when creating or modifying |UCSUAS| users (:uv:bug:`55392`).
de: Intern: Es wurde eine Option hinzugefügt, die die Evaluierung der Passwort Richtlinien während des Erstellens und Bearbeitens von |UCSUAS| Benutzern aktiviert (:uv:bug:`55392`).

source: Internal: Add classes UbuntuComputer and LinuxComputer to |UCSUAS| library (:uv:bug:`55119`).
de: Intern: Die |UCSUAS| Bibliothek wurde um die Klassen UbuntuComputer und LinuxComputer erweitert (:uv:bug:`55119`)

source: Source package *ucs-school-import* in version ``18.0.26A~5.0.0.202211151540``:
de: Quellpaket *ucs-school-import* in Version ``18.0.26A~5.0.0.202211151540``:

source: The evaluation of password policies during the import of new users can now be enabled by setting the configuration option ``evaluate_password_policies``. It is disabled by default (:uv:bug:`55400`).
de: The Evaluierung von Passwort Richtlinien während des Imports neuer Benutzer kann jetzt durch Setzen der Konfigurationsoption ``evaluate_password_policies`` eingeschaltet werden. Sie ist standardmäßig deaktiviert (:uv:bug:`55400`).

source: Regression: The script ``import_computers`` supports computers of type ``linux`` and ``ubuntu`` again (:uv:bug:`55119`).
de: Regression: Das Skript: ``import_computers`` unterstützt wieder den Import von Computern der Typen ``linux`` und ``ubuntu`` (:uv:bug:`55119`).

source: Released on 2022-11-02
de: Veröffentlicht am 2. November 2022

source: Source package *ucs-school-lib* in version ``13.0.24A~5.0.0.202210061204``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.24A~5.0.0.202210061204``:

source: |UCSUAS| validation errors are logged with level ``WARNING`` instead of log level ``ERROR`` (:uv:bug:`55233`).
de: Fehler in der |UCSUAS| Validierung werden mit Debuglevel ``WARNING`` statt mit Debuglevel ``ERROR`` geloggt (:uv:bug:`55233`).

source: Source package *ucs-school-import* in version ``18.0.24A~5.0.0.202211011527``:
de: Quellpaket *ucs-school-import* in Version ``18.0.24A~5.0.0.202211011527``:

source: Fix: Creating large data sets of test users sometimes failed due to non unique ``record_uids`` (:uv:bug:`55134`).
de: Fix: Das Erstellen von großen Datensets an Test Benutzers schlug fehl, da die ``record_uids`` nicht eindeutig waren (:uv:bug:`55134`).

source: Fix: When importing computers with a specified network instead of specific IP address, the import failed (:uv:bug:`55130`).
de: Fix: Wenn Computer importiert wurden und ein Netzwerk angegeben wurde, schlug der Import fehl (:uv:bug:`55130`).

source: Released on 2022-08-25:
de: Veröffentlicht am 25. August 2022

source: Source package *ucs-school-import* in version ``18.0.21A~5.0.0.202208241614``:
de: Quellpaket *ucs-school-import* in Version ``18.0.21A~5.0.0.202208241614``:

source: Fix user validation in mass import with *dry-run* (:uv:bug:`55016`).
de: Korrektur der Benutzerüberprüfung beim Massenimport mit *dry-run* (:uv:bug:`55016`).

source: Underscores are now allowed in OU names, when the hostname of the school server is also passed (:uv:bug:`55125`).
de: Unterstriche sind jetzt in OU-Namen erlaubt, wenn der Hostname des Schulservers mit übergeben wird (:uv:bug:`55125`).

source: Source package *ucs-school-lib* in version ``13.0.23A~5.0.0.202208241612``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.23A~5.0.0.202208241612``:

source: Internal: Add ``check_name`` parameter to the :py:meth:`validate` method of multiple classes which allows disabling name checks such as checking if a user with the same user name already exists in another school (:uv:bug:`55016`).
de: Intern: Hinzufügen des ``check_name``-Parameters zur :py:meth:`validate`-Methode mehrerer Klassen, der es ermöglicht, Namensprüfungen zu deaktivieren, wie z.B. die Prüfung, ob ein Benutzer mit demselben Benutzernamen bereits in einer anderen Schule existiert (:uv:bug:`55016`).

source: Released on 2022-08-17:
de: Veröffentlicht am 17. August 2022

source: Source package *ucs-school-import* in version ``18.0.19A~5.0.0.202208171134``:
de: Quellpaket *ucs-school-import* in Version ``18.0.19A~5.0.0.202208171134``:

source: A validation error causing an infinite recursion error was fixed (:uv:bug:`55083`).
de: Ein Überprüfungsfehler, der eine unendliche Rekursion verursachte, wurde behoben (:uv:bug:`55083`).

source: Source package *ucs-school-umc-internetrules* in version ``16.0.4A~5.0.0.202208110901``:
de: Quellpaket *ucs-school-umc-internetrules* in Version ``16.0.4A~5.0.0.202208110901``:

source: A bug was fixed which caused groups not being displayed in the *Assign internet rules* module when group prefixes were set via an UCR variable (:uv:bug:`55034`).
de: Ein Fehler wurde behoben, der dazu führte, dass Gruppen im Modul *Internetregeln zuweisen* nicht angezeigt wurden, wenn Gruppenpräfixe über eine UCR-Variable gesetzt wurden (:uv:bug:`55034`).

source: Released on 2022-08-04:
de: Veröffentlicht am 4. August 2022

source: Source package *ucs-school-import* in version ``18.0.18A~5.0.0.202207191615``:
de: Quellpaket *ucs-school-import* in Version ``18.0.18A~5.0.0.202207191615``:

source: The |UCSUAS| import *dry-run* does not raise *ValidationErrors* for all subsequent users after an error (:uv:bug:`54118`).
de: Der |UCSUAS| Import *dry-run* löst nach einem Fehler keine *ValidationErrors* für alle nachfolgenden Benutzer aus (:uv:bug:`54118`).

source: Internal change: preserve workgroups during import, to avoid a behavior change (:uv:bug:`54943`).
de: Interne Änderung: Beibehaltung von Arbeitsgruppen beim Import, um eine Verhaltensänderung zu vermeiden (:uv:bug:`54943`).

source: Source package *ucs-school-lib* in version ``13.0.21A~5.0.0.202207281220``:
de: Quellpaket *ucs-school-lib* in Version ``13.0.21A~5.0.0.202207281220``:

source: User objects now have the ``workgroups`` attribute (:uv:bug:`54943`).
de: Benutzerobjekte haben jetzt das Attribut ``workgroups`` (:uv:bug:`54943`).

source: School admins are removed from ``admins-OU`` group when :py:meth:`remove_from_groups_of_school` is called (:uv:bug:`54368`).
de: Schuladministratoren werden aus der Gruppe ``admins-OU`` entfernt, wenn :py:meth:`remove_from_groups_of_school` aufgerufen wird (:uv:bug:`54368`).

source: Source package *ucs-school-umc-distribution* in version ``18.0.6A~5.0.0.202207201625``:
de: Quellpaket *ucs-school-umc-distribution* in Version ``18.0.6A~5.0.0.202207201625``:

source: Invalid project directories named ``.`` or ``..`` are now handled correctly (:uv:bug:`52719`).
de: Ungültige Projektverzeichnisse mit dem Namen ``.`` oder ``..`` werden nun korrekt behandelt (:uv:bug:`52719`).

source: Source package *ucs-school-umc-exam* in version ``10.0.6A~5.0.0.202207201619``:
de: Quellpaket *ucs-school-umc-exam* in Version ``10.0.6A~5.0.0.202207201619``:

source: The directory name validation now detects all incorrect names. Additionally, the exam directory name description has been improved (:uv:bug:`52719`).
de: Die Überprüfung von Verzeichnisnamen erkennt nun alle fehlerhaften Namen, außerdem wurde die Beschreibung des Prüfungs-Verzeichnisnamens verbessert (:uv:bug:`52719`).

source: Source package *ucs-school-veyon-windows* in version ``4.7.4.0-ucs5.0-1A~5.0.0.202208021248``:
de: Quellpaket *ucs-school-veyon-windows* in Version ``4.7.4.0-ucs5.0-1A~5.0.0.202208021248``:

source: The *Veyon* windows installer has been updated from 4.5.2 to 4.7.4 (:uv:bug:`55029`).
de: Der *Veyon* Windows Installer wurde von 4.5.2 auf 4.7.4 aktualisiert (:uv:bug:`55029`).
