Repository: openfnord/ucs-school
Catalog: ucs-school-umc-exam/umc/python/schoolexam-master/*.po
Languages: de

source: Could not remove exam user %(userdn)r: %(exc)s
de: Klassenarbeitsbenutzerkonto %(userdn)r konnte nicht gelöscht werden: %(exc)s

source: ERROR: Creation of exam user account failed %s
de: FEHLER: Anlegen des Klassenarbeitsbenutzerkontos fehlgeschlagen %s

source: Exam for user %s
de: Klassenarbeit für Benutzer %s

source: Exam student %r not found.
de: Klassenarbeitsbenutzerkonto %r nicht gefunden.

source: Exam user %(exam_user_uid)r not found.
de: Klassenarbeitsbenutzerkonto %(exam_user_uid)r nicht gefunden.

source: ExamStudent %(exam_user_dn)r added to LDAP but cannot be loaded: %(exc)r.
de: Klassenarbeitsbenutzer %(exam_user_dn)r wurde dem LDAP hinzugefügt, konnte aber nicht geladen werden: %(exc)r.

source: Failed to create exam container %s
de: Container für Klassenarbeitsbenutzer konnte nicht angelegt werden %s

source: Failed to create exam group %s
de: Klassenarbeitsgruppe konnte nicht angelegt werden %s

source: Requested exam username %(exam_user_uid)s is not allowed according to settings/prohibited_username object %(prohibited_object_name)s
de: Gewünschter Klassenarbeitsbenutzername %(exam_user_uid)s ist nicht erlaubtgemäß des Objekts settings/prohibited_username %(prohibited_object_name)s

source: Student %(user_dn)r not found: %(exc)r.
de: Schüler %(user_dn)r nicht gefunden: %(exc)r.

source: Student %r not found.
de: Schüler %r nicht gefunden.

source: The exam account does already exist for: %s
de: Der Klassenarbeitsbenutzername %s existiert schon
