Repository: openfnord/ucs-school
Catalog: ucs-school-umc-rooms/umc/js/*.po
Languages: de

source: Add room
de: Raum hinzufügen

source: Cancel
de: Abbrechen

source: Choose the school
de: Schule auswählen

source: Computerroom backend
de: Computerraum Backend

source: Computers
de: Computer

source: Computers in the room
de: Computer in dem Raum

source: Create a new room
de: Erstelle einen neuen Raum

source: Create room and assign computers
de: Raum erstellen und Computer zuweisen

source: Delete
de: Löschen

source: Deleting the selected objects.
de: Löschen der ausgewählten Objekte

source: Description
de: Beschreibung

source: Edit
de: Bearbeiten

source: Edit room
de: Raum bearbeiten

source: Edit room and assign computers
de: Raum bearbeiten und Computer zuweisen

source: Edit the selected object
de: Bearbeiten des ausgewählten Raums

source: Italc (Default)
de: Italc (Standard)

source: No rooms found
de: Keine Räume gefunden

source: No rooms were found.
de: Es wurden keine Räume gefunden.

source: Properties
de: Eigenschaft

source: Room %s not created. It already exists.
de: Raum %s wurde nicht angelegt. Er existiert bereits.

source: Save
de: Speichern

source: School
de: Schule

source: Search pattern
de: Suchmuster

source: Search...
de: Suche...

source: Should the room {name} be deleted?
de: Soll der Raum {name} gelöscht werden?

source: Specifies the substring pattern which is searched for in the displayed name
de: Legt die Zeichenketten die in dem angezeigten Namen gesucht werden soll fest

source: Teacher computer
de: Lehrercomputer

source: The room could not be deleted ({message})
de: Der Raum konnte nicht gelöscht werden ({message})

source: The room has been deleted successfully
de: Der Raum wurde erfolgreich gelöscht

source: This is the default backend for the computerroom module.
de: Das ist das Standard-Backend für das Computerraum-Modul

source: This is the new computerroom backend.
de: Das ist das neue Backend für das Computerraum-Modul

source: Verbose description of the current group
de: Ausführliche Beschreibung der Gruppe

source: Would you like to create a room now?
de: Möchten Sie jetzt einen Raum anlegen?
