Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-import/umc/python/schoolimport/*.po
Languages: fr

source: A time out occurred during examining the data.
fr: Un délai a expiré pendant l’examen des données.

source: Examining data...
fr: Examen des données…

source: No permissions for running an import for any school.
fr: Pas d’autorisation pour l’exécution d’une importation pour une école.

source: No permissions for running an import for any user role.
fr: Pas d’autorisation pour l’exécution d’une importation pour un rôle de compte d’utilisation.

source: Please wait until the examination of the data is complete.
fr: Veuillez attendre que l’examen des données soit terminé.

source: Staff
fr: Personnel administratif

source: Student
fr: Élève

source: Teacher
fr: Personnel enseignant

source: Teacher and Staff
fr: Personnel enseignant et administratif

source: The UCS@school Import API HTTP server is not reachable: %s
fr: Le serveur HTTP de l’API d’importation de UCS@school n’est pas accessible : %s

source: The UCS@school import API HTTP server could not be reached. It seems it is misconfigured, not installed or a proxy/firewall is blocking it.
fr: Le serveur HTTP de l’API d’importation de UCS@school n’a pas pu être atteint. Il semble qu’il soit mal configuré, non installé ou qu’un proxy/pare-feu le bloque.

source: The connection to the import server could not be established.
fr: La connexion au serveur d’importation n’a pas pu être établie.

source: The examination of the data failed.
fr: L’examen des données a échoué.

source: The permissions to perform a user import are not sufficient enough.
fr: Les autorisations ne sont pas suffisantes pour effectuer une importation de comptes d’utilisation.
