Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-lib/modules/ucsschool/lib/*.po
Languages: fr

source: "%(label)s" needs to be a %(type)s
fr: « %(label)s » doit être du type %(type)s

source: "%s" is required. Please provide this information.
fr: « %s » est indispensable. Veuillez fournir cette information.

source: A valid NetBIOS hostname can not be longer than 13 characters.
fr: Un nom d’hôte NetBIOS valide ne peut pas dépasser 13 caractères.

source: Administrative servers
fr: Serveurs administratifs

source: Birthday
fr: Date de naissance

source: Broadcast
fr: Diffusion

source: Class
fr: Classe

source: Computer
fr: Ordinateur

source: Computer path
fr: Chemin d’accès à l’ordinateur

source: Container
fr: Conteneur

source: Context {role}:{context_type}:{context} is not allowed for {dn}. Object is not in that school.
fr: Le contexte {role}:{context_type}:{context} n’est pas autorisé pour {dn}. L’objet n’est pas dans cette école.

source: Could not find any school. You have to create a school before continuing. Use the "Schools" UMC module to create one.
fr: Impossible de trouver une école. Vous devez créer une école avant de continuer. Utilisez le module UMC « Écoles » pour en créer une.

source: DC Name
fr: Nom du contrôleur de domaine (DC)

source: DC Name administrative server
fr: Nom du contrôleur de domaine (DC) pour le serveur administratif

source: DHCP path
fr: Chemin pour DHCP

source: DHCP service
fr: Service DHCP

source: Device with IP address
fr: Appareil avec une adresse IP

source: Disabled
fr: Désactivé

source: Display name
fr: Nom affiché

source: Domain
fr: Domaine

source: Educational servers
fr: Serveurs éducatifs

source: Empty attributes
fr: Attributs vides

source: Exam student
fr: Élève pour l’examen

source: Expiration date
fr: Date d’expiration

source: First name
fr: Prénom

source: Group path
fr: Chemin d’accès au groupe

source: Groups
fr: Groupes

source: Groups that are allowed to send e-mails to the group
fr: Groupes autorisés à envoyer des e-mails au groupe

source: Hostname
fr: Nom d’hôte

source: Hostname of educational DC and administrative DC must not be equal
fr: Les contrôleurs de domaine éducatif et administratif ne peuvent pas avoir le même nom d’hôte

source: Hosts
fr: Hôtes

source: IP address
fr: Adresse IP

source: Invalid Domain Controller name
fr: Nom du contrôleur de domaine non valide

source: Invalid school name
fr: Nom de l’école non valide

source: Inventory number
fr: Numéro d’inventaire

source: It is not supported to change the role of a user. %(old_role)s %(name)s cannot become a %(new_role)s.
fr: Le changement de rôle d’un utilisateur ou d’une utilisatrice n’est pas pris en charge. %(name)s ne peut pas passer du rôle %(old_role)s au rôle %(new_role)s.

source: Last name
fr: Nom de famille

source: MAC address
fr: Adresse MAC

source: May not contain special characters
fr: Ne peut pas contenir de caractères spéciaux

source: Name
fr: Nom

source: Netmask
fr: Masque de réseau

source: Network
fr: Réseau

source: Network path
fr: Chemin d’accès réseau

source: Overlapping lessons are not allowed
fr: Les leçons qui se chevauchent ne sont pas autorisées

source: Password
fr: Mot de passe

source: Policy path
fr: Chemin d’accès à la stratégie

source: Printer path
fr: Chemin d’accès à l’imprimante

source: Role has bad format
fr: Le rôle a un mauvais format

source: Roles
fr: Rôles

source: School
fr: École

source: School Administrator
fr: Administrateur ou administratrice de l’école

source: School class
fr: Classe de l’école

source: School name
fr: Nom de l’école

source: School {school!r} in 'school_classes' is missing in the users 'school(s)' attributes.
fr: L’école {school!r} mentionnée dans 'school_classes' est absente de l’attribut 'school(s)' de l’utilisateur ou utilisatrice.

source: Schools
fr: Écoles

source: Server for Windows home directories
fr: Serveur pour les répertoires personnels Windows

source: Server for class shares
fr: Serveur pour les partages de classe

source: Server name
fr: Nom du serveur

source: Share path
fr: Chemin d’accès au partage

source: Staff
fr: Personnel administratif

source: Student
fr: Élève

source: Subnet
fr: Sous-réseau

source: Subnet address
fr: Adresse de sous-réseau

source: Subnet mask
fr: Masque de sous-réseau

source: Teacher
fr: Enseignant·e

source: Teacher and Staff
fr: Personnel enseignant et administratif

source: The email address is already taken by another user. Please change the email address.
fr: L’adresse e-mail est déjà prise par un autre utilisateur ou une autre utilisatrice. Veuillez modifier l’adresse e-mail.

source: The ip address is already taken by another computer. Please change the ip address.
fr: L’adresse IP est déjà prise par un autre ordinateur. Veuillez modifier l’adresse IP.

source: The length of fully qualified domain name is greater than 63 characters.
fr: La longueur du nom de domaine pleinement qualifié (FQDN) dépasse 63 caractères.

source: The mac address is already taken by another computer. Please change the mac address.
fr: L’adresse MAC est déjà prise par un autre ordinateur. Veuillez modifier l’adresse MAC.

source: The name is already used somewhere outside the school. It may not be taken twice and has to be changed.
fr: Le nom est déjà utilisé quelque part à l’extérieur de l’école. Il ne peut pas être pris deux fois et doit être modifié.

source: The newly created network would overlap with the existing network {}
fr: Le réseau nouvellement créé chevaucherait le réseau existant {}

source: The request did not specify any school. You have to create a school before continuing. Use the "Schools" UMC module to create one.
fr: La requête ne précisait pas d’école. Vous devez créer une école avant de continuer. Utilisez le module UMC « Écoles » pour en créer une.

source: The school "%s" does not exist. Please choose an existing one or create it.
fr: L’école « %s » n’existe pas. Veuillez en choisir une existant ou la créer.

source: The specified IP and subnet mask will cause the creation of a new network during the creation of the computer object.
fr: L’adresse IP et le masque de sous-réseau spécifiés entraîneront la création d’un nouveau réseau lors de la création de l’objet ordinateur.

source: The value changed from %(old)s. This seems unlikely.
fr: La valeur n’est plus %(old)s. Un changement est inhabituel.

source: There are no free addresses left in the subnet!
fr: Il n’y a plus d’adresses libres dans le sous-réseau !

source: Type of 'school_classes' is {type!r}, but must be dictionary.
fr: Le type de 'school_classes' est {type!r}, mais doit être un dictionnaire.

source: Unknown context type
fr: Type de contexte inconnu

source: Unknown role
fr: Rôle inconnu

source: User path
fr: Chemin d’accès de compte d’utilisation

source: Username
fr: Identifiant

source: Users
fr: Utilisateurs et utilisatrices

source: Users that are allowed to send e-mails to the group
fr: Utilisateurs et utilisatrices autorisé·es à envoyer des e-mails au groupe

source: Windows system
fr: Système Windows

source: Work group
fr: Groupe de travail
