Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-import/umc/js/*.po
Languages: fr

source: A new import of %(role)s users at school %(school)s has been started. The import has the ID %(id)s.
fr: Une nouvelle importation d’utilisateurs et utilisatrices %(role)s à l’école %(school)s a été lancée. L’importation a l’ID %(id)s.

source: Aborted
fr: Interrompue

source: An error occurred.
fr: Une erreur s’est produite.

source: Back to overview
fr: Retour à la vue d’ensemble

source: Click %s to draft an email with all the required information.
fr: Cliquez %s pour préparer un e-mail contenant toutes les informations requises.

source: Data examination completed
fr: Examen des données terminé

source: Import user accounts
fr: Importer des comptes d’utilisation

source: Job ID
fr: ID de la tâche

source: List of running and completed user imports. For every completed user import a summary is provided with every change that was made as well as a list of passwords for newly created user accounts.
fr: Liste des importations de comptes d’utilisation en cours d’exécution et terminées. Pour chaque importation de comptes d’utilisation terminée, une synthèse indique toutes les modifications apportées ainsi qu’une liste de mots de passe pour les comptes d’utilisation nouvellement créés.

source: New
fr: Nouvelle

source: Overview User Imports
fr: Vue d’ensemble des importations de comptes d’utilisation

source: Passwords
fr: Mots de passe

source: Please examine the reason for this error: %s
fr: Veuillez examiner la raison de cette erreur : %s

source: Please notify the system administrator about this error via email.
fr: Veuillez informer l’administrateur ou administratrice système de cette erreur par e-mail.

source: Please select a file. This will start a validation proccess of the data.
fr: Veuillez sélectionner un fichier. Ceci lancera un processus de validation des données.

source: Please select and upload the data export from the School Information System.
fr: Veuillez sélectionner et télécharger les données exportées depuis le système d’information scolaire.

source: Please select the school and the role of user for the import.
fr: Veuillez sélectionner l’école et le rôle des comptes d’utilisation pour l’importation.

source: Please wait until the examination of the data is complete.
fr: Veuillez attendre que l’examen des données soit terminé.

source: Reload
fr: Recharger

source: Scheduled
fr: Planifiée

source: School
fr: École

source: Select file
fr: Sélectionner le fichier

source: Select the school where the import should be done.
fr: Sélectionnez l’école dans laquelle l’importation doit être effectuée.

source: Select the user role.
fr: Sélectionnez le rôle des comptes d’utilisation.

source: Start import
fr: Démarrer l’importation

source: Start new user import
fr: Démarrer une nouvelle importation de comptes d’utilisation

source: Started
fr: Démarrée

source: Started at
fr: Démarrée à

source: Started by
fr: Démarrée par

source: Status
fr: État

source: Successful
fr: Réussie

source: Summary
fr: Synthèse

source: The examination of the uploaded data completed successfully. In the following, you can see the output of the data import interface. Press "Start Import" to proceed with the actual user import.
fr: L’examen des données téléchargées s’est terminé avec succès. Dans ce qui suit, vous voyez les résultats de l’interface d’importation des données. Cliquez sur « Démarrer l’importation » pour procéder à l’importation effective des comptes d’utilisation.

source: The import was started successfully.
fr: L’importation a été démarrée avec succès.

source: Upload data
fr: Envoyer des données

source: User import: Error in job %s
fr: Importation des comptes d’utilisation : erreur dans la tâche %s

source: User role
fr: Rôle des comptes d’utilisation

source: View finished imports
fr: Afficher les importations terminées

source: here
fr: ici
