Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-wizards/umc/python/schoolwizards/*.po
Languages: fr

source: "%s" already exists!
fr: « %s » existe déjà !

source: "%s" does not exist!
fr: « %s » n’existe pas !

source: Could not create class
fr: Impossible de créer la classe

source: Could not create computer
fr: Impossible de créer l’ordinateur

source: Execution of command failed
fr: Échec de l’exécution de la commande

source: Failed to remove user from school.
fr: Impossible de supprimer le compte d’utilisation de l’école.

source: The %(attr)s %(name)r does not exist or might have been removed in the meantime.
fr: %(attr)s %(name)r n’existe pas ou a peut-être été supprimé entre temps.

source: You do not have the right to delete the user with the dn %(dn)s from the school %(school)s.
fr: Vous n’avez pas le droit de supprimer le compte d’utilisation avec le DN %(dn)s de l’école %(school)s.

source: You do not have the right to modify the object with the DN %(dn)s from the schools [%(schools)s].
fr: Vous n’avez pas le droit de modifier l’objet avec le DN %(dn)s des écoles [%(schools)s].

source: You do not have the rights to create an object for the schools [%s].
fr: Vous n’avez pas le droit de créer un objet pour les écoles [%s].
