Repository: openfnord/ucs-school
Catalog: ucs-school-umc-distribution/umc/python/distribution/*.po
Languages: de

source: A valid project owner needs to be specified.
de: Für ein gültiges Projekt muss ein Besitzer definiert sein.

source: Could not save project file: %s (%s)
de: Das Projekt konnte nicht gespeichert werden: %s (%s)

source: Could not set date for: %s
de: Die Zeit konnte nicht gesetzt werden: %s

source: Distributing the data needs to happen sufficiently long enough before collecting them
de: Die Verteilung der Daten muss ausreichend lange vor ihrem Einsammeln geschehen

source: Failed to load user information: %s
de: Das Laden der Benutzerinformationen schlug fehl: %s

source: Only the owner himself or an administrator may delete a project.
de: Nur der Eigentümer selbst oder ein Administrator können ein Projekt löschen.

source: Only the owner himself or an administrator may distribute a project.
de: Nur der Eigentümer selbst oder ein Administrator können ein Projekt austeilen.

source: Project "%s" could not be loaded
de: Das Projekt "%s" konnte nicht geladen werden

source: Project collection
de: Projekteinsammlung

source: Project details are only visible to the project owner himself or an administrator.
de: Projekteigenschaften sind nur sichtbar für den Eigentümer selbst oder einen Administrator.

source: Project distribution
de: Projektverteilung

source: The following user directories could not been collected: %s
de: Die folgenden Benutzer-Verzeichnisse konnten nicht eingesammelt werden: %s

source: The given project description must be non-empty.
de: Die angegebene Projektbeschreibung darf nicht leer sein.

source: The given project directory name must be non-empty.
de: Das angegebene Projektverzeichnis darf nicht leer sein.

source: The project can only be modified by the owner himself
de: Ein Projekt kann nur durch den Eigentümer selbst bearbeitet werden

source: The project could not distributed to the following users: %s
de: Das Projekt konnte nicht an die folgenden Benutzer ausgeteilt werden: %s

source: The specified project directory may at most be 254 characters long.
de: Das angegebene Projektverzeichnis darf maximal 254 Zeichen lang sein

source: The specified project directory may not contain the character "%s".
de: Das angegebene Projektverzeichnis darf nicht das Zeichen "%s" enthalten.

source: The specified project directory may not start nor end with a ".".
de: Das angegebene Projektverzeichnis darf nicht mit einem "." beginnen oder enden.

source: The specified project directory may not start nor end with a space.
de: Das angegebene Projektverzeichnis darf nicht mit einem Leerzeichen beginnen oder enden.

source: The specified project directory must be different from "." and "..".
de: Das angegebene Projektverzeichnis muss verschieden sein von "." and "..".

source: The specified project directory name "%s" is already in use by a different project.
de: Das angegebene Projektverzeichnis "%s" wird bereits verwendet.

source: The specified project does not exist: %s
de: Das angegebene Projekt existiert nicht: %s

source: The specified time needs to lie in the future for: %s
de: Die angegebene Zeit muss in der Zukunft liegen: %s
