Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-installer/umc/python/schoolinstaller/*.po
Languages: fr

source: An unexpected error occurred during installation: %s
fr: Une erreur inattendue est apparue lors de l'installation : %s

source: Cannot get lock for installation process. Another package manager seems to block the operation.
fr: Impossible d'obtenir le verrou du processus d'installation. Un autre gestionnaire de paquetages semble bloquer l'opération.

source: Could not connect to the Primary Directory Node %s: %s
fr: Impossible de se connecter au Primary Directory Node %s: %s

source: Creation of LDAP school structure
fr: Création de la structure LDAP de l'école

source: Domain join
fr: Rejoindre le domaine

source: Executing join script %s
fr: Exécution du script de jonction %s

source: Executing join scripts...
fr: Exécution des scripts de jonction...

source: Failed to install packages.
fr: Échec de l'installation des paquetages.

source: In order to install UCS@school on a Backup Directory Node, the system needs to be joined first.
fr: Afin d'installer UCS@school sur un Backup Directory Node, le système doit d'abord rejoindre le domaine.

source: Initializing
fr: Initialisation

source: Installation of UCS@school packages
fr: Installation des paquetages UCS@school

source: Invalid UCS@school configuration.
fr: Configuration UCS@school invalide.

source: Invalid server role! UCS@school can only be installed on the system roles Primary Directory Node, Backup Directory Node, or Replica Directory Node.
fr: Rôle de serveur non valide ! UCS@school ne peut être installé que sur les rôles de système suivants : Primary Directory Node, Backup Directory Node ou Replica Directory Node.

source: Make sure ucs-school-umc-installer is installed on the Primary Directory Node and all join scripts are executed.
fr: Assurez-vous que « ucs-school-umc-installer » est installé sur le Primary Directory Node et que tous les scripts de jonction sont exécutés.

source: Please install UCS@school on the Primary Directory Node. Cannot proceed installation on this system.
fr: Veuillez installer UCS@school sur le Primary Directory Node. Impossible de procéder à l'installation sur ce système.

source: Preparing domain join...
fr: Préparation pour rejoindre le domaine...

source: Server type has to be set for Replica Directory Node
fr: Le type de serveur doit être défini à Recplica Directory Node

source: Software packages have been installed successfully, however, some join scripts could not be executed. More details can be found in the log file /var/log/univention/join.log. Please retry to execute the join scripts via the UMC module "Domain join" after resolving any conflicting issues.
fr: Les paquetages logiciels ont été installés avec succès, cependant certains scripts de jonction n'ont pu être exécutés. Des détails supplémentaires se trouvent dans le fichier journal « /var/log/univention/join.log ». Veuillez réessayer d'exécuter les scripts de jonction par le biais du module UMC « Rejoindre le domaine » après avoir résolu les problèmes de conflits éventuels.

source: Software packages have been installed successfully, however, the join process could not be executed. More details can be found in the log file /var/log/univention/join.log. Please retry to join the system via the UMC module "Domain join" after resolving any conflicting issues.
fr: Les paquetages logiciels ont été installés avec succès, cependant certains scripts de jonction n'ont pu être exécutés. Des détails supplémentaires se trouvent dans le fichier journal « /var/log/univention/join.log ». Veuillez réessayer d'exécuter les scripts de jonction par le biais du module UMC « Rejoindre le domaine » après avoir résolu les problèmes de conflits éventuels.

source: Software packages have been installed, however, the system join could not be completed: %s. More details can be found in the log file /var/log/univention/join.log. Please retry the join process via the UMC module "Domain join" after resolving any conflicting issues.
fr: Les paquetages logiciels ont été installés, cependant, le système n'a pu rejoindre le domaine : %s. Des détails supplémentaires se trouvent dans le fichier journal « /var/log/univention/join.log ». Veuillez réessayer d'exécuter les scripts de jonction par le biais du module UMC « Rejoindre le domaine » après avoir résolu les problèmes de conflits éventuels.

source: The LDAP connection to the Primary Directory Node failed.
fr: Échec de la connexion LDAP au Primary Directory Node.

source: The Primary Directory Node is not configured for a UCS@school multi server environment. Cannot proceed installation on this system.
fr: Le Primary Directory Node n'est pas configuré pour un environnement multi-serveurs UCS@school. Impossible d'effectuer l'installation sur ce système.

source: The UCS@school Primary Directory Node needs to be configured similarly to this Backup Directory Node. Please choose the correct environment type for this system.
fr: Le Primary Directory Node de UCS@school doit être configuré de la même manière que ce Backup Directory Node. Veuillez choisir le type d’environnement approprié pour ce système.

source: The UCS@school software packages have been installed, however, a school OU could not be created and consequently a re-join of the system has not been performed. Please create a new school OU structure using the UMC module "Add school" on the Primary Directory Node and perform a domain join on this machine via the UMC module "Domain join".
fr: Les paquetages logiciels de UCS@school ont été installés, toutefois une unité organisationnelle d’école n’a pas pu être créée et, par conséquent, le système n’a pas pu rejoindre à nouveau le domaine. Veuillez créer une nouvelle structure d’unité organisationnelle d’école via le module UMC « Ajouter une école » sur le Primary Directory Node, puis effectuer la jonction de cette machine au domaine via le module UMC « Intégration au domaine ».

source: The entered FQDN is not a valid value
fr: Le FQDN saisi n'est pas correct

source: The name of an educational server has to be specified if the system shall be configured as administrative server.
fr: Le nom d'un serveur éducatif doit être précisé si le système est prévu pour être configuré comme serveur administratif.

source: The name of the educational server may not be equal to the name of the administrative Replica Directory Node.
fr: Le nom du serveur éducatif ne peut être le même que celui du Replica Directory Node administratif.

source: The specified school OU is not valid.
fr: L’unité organisationnelle d’école spécifiée n’est pas valide.

source: This UCS domain uses Samba 3 which is no longer supported by UCS@school. Please update all domain systems to samba 4 to be able to continue.
fr: Ce domaine UCS utilise Samba 3, qui n'est plus pris en charge par UCS@school. Veuillez mettre à jour tous les systèmes du domaine vers Samba 4 pour pouvoir continuer.

source: Validating the LDAP school OU structure failed. It seems that the current Replica Directory Node has already been assigned to a different school or that the specified school OU name is already in use.
fr: Échec de la validation de la structure LDAP de l’unité organisationnelle de l’école. Il semble que le Replica Directory Node actuel soit déjà assigné à une autre école ou que le nom spécifié pour l’unité organisationnelle de l'école soit déjà utilisé.

source: finished...
fr: terminé...
