Repository: openfnord/ucs-school
Catalog: ucs-school-umc-exam/umc/python/schoolexam/*.po
Languages: de

source: The student data must be corrected by an Administrator before the students can be added to the exam.
de: Die Schülerdaten müssen von einem Administrator korrigiert werden bevor die Schüler zu der Klassenarbeit hinzugefügt werden können.

source: An exam with the name "%s" already exists. Please choose a different name for the exam.
de: Eine Klassenarbeit unter dem Namen "%s" existiert bereits. Bitte wählen Sie einen anderen Namen.

source: An unexpected error occurred during the preparation: %s
de: Ein unerwarteter Fehler trat währende der Vorbereitung auf: %s

source: Collecting exam files...
de: Einsammeln der Klassenarbeitsdateien...

source: Configuring the computer room...
de: Einrichtung des Computerraumes...

source: Could not authenticate user "%s"!
de: Der Benutzer "%s" konnte nicht authentifiziert werden!

source: Could not connect to Primary Directory Node %s.
de: Die Verbindung zum Primary Directory Node %s konnte nicht aufgebaut werden.

source: Distributing exam files
de: Verteilung der Klassenarbeitsdateien

source: Error loading group DN {!r}.
de: Fehler beim Laden der Gruppen DN {!r}.

source: Exam details are only visible to the exam owner himself.
de: Die Details einer Klassenarbeit können nur von ihrem Eigentümer eingesehen werden.

source: Initializing
de: Einrichtung

source: No files have been distributed
de: Keine Dateien wurden verteilt

source: Please contact an administrator. An error occurred while loading one of the samba share configuration files (see configuration file /etc/samba/shares.conf and configuration files below /etc/samba/shares.conf.d/). Known causes for this are wrong file permissions and typos in the configuration files.
de: Bitte wenden Sie sich an einen Administrator. Beim Laden einer der Samba-Freigabekonfigurationsdateien ist ein Fehler aufgetreten (siehe Konfigurationsdatei /etc/samba/shares.conf und Konfigurationsdateien unterhalb von /etc/samba/shares.conf.d/). Bekannte Ursachen dafür sind falsche Dateiberechtigungen und Tippfehler in den Konfigurationsdateien.

source: Prepare room settings
de: Vorbereiten der Raumeinstellungen

source: Preparing exam accounts
de: Vorbereitung der Klassenarbeitskonten

source: Preparing the computer room for exam mode...
de: Einrichtung des Computerraumes für den Klassenarbeitsmodus...

source: Preparing user home directories
de: Einrichten der Heimatverzeichnisse

source: Removing exam accounts
de: Entfernen der Klassenarbeitskonten

source: Replication timeout: could not create all exam users
de: Replikations-Timeout: Nicht alle Klassenarbeitskonten konnten erstellt werden

source: Room "%s" does not contain any computers. Empty rooms may not be used to start an exam.
de: Raum "%s" enthält keine Rechner. Klassenarbeiten können nicht in leeren Räumen gestartet werden.

source: The exam can only be modified by the owner himself.
de: Die Klassenarbeit kann nur von ihrem Eigentümer bearbeitet werden.

source: The exam was already started and can not be modified anymore!
de: Die Klassenarbeit wurde schon gestarted und kann nicht mehr bearbeitet werden!

source: The following students have validation errors:
de: Die folgenden Schüler haben Validierungsfehler:

source: The specified exam does not exist: %s
de: Die spezifizierte Klassenarbeit existiert nicht: %s

source: finished...
de: beendet...
