Repository: openfnord/ucs-school
Catalog: ucs-school-umc-installer/umc/python/schoolinstaller/*.po
Languages: de

source: An unexpected error occurred during installation: %s
de: Ein unerwarteter Fehler trat während der Installation auf: %s

source: Cannot get lock for installation process. Another package manager seems to block the operation.
de: Die Sperre für den Installationsprozess konnte nicht angelegt werden. Eine andere Paket-Manager-Instanz scheint die Ausführung zu blockieren.

source: Could not connect to the Primary Directory Node %s: %s
de: Konnte nicht mit dem Primary Directory Node %s verbinden: %s

source: Creation of LDAP school structure
de: Erstellen der LDAP-Schul-Struktur

source: Domain join
de: Domänenbeitritt

source: Executing join script %s
de: Ausführung des Join-Skriptes %s

source: Executing join scripts...
de: Ausführung der Join-Skripte...

source: Failed to install packages.
de: Konnte keine Pakete installieren.

source: In order to install UCS@school on a Backup Directory Node, the system needs to be joined first.
de: Bevor UCS@school auf einem Backup Directory Node installiert werden kann, muss dieses System zuerst der Domäne beigetreten sein.

source: Initializing
de: Einrichten

source: Installation of UCS@school packages
de: Installation der UCS@school-Pakete

source: Invalid UCS@school configuration.
de: Ungültige UCS@school-Konfiguration

source: Invalid server role! UCS@school can only be installed on the system roles Primary Directory Node, Backup Directory Node, or Replica Directory Node.
de: Ungültige Systemrolle! UCS@school kann nur auf den Systemrollen Primary Directory Node, Backup Directory Node sowie Replica Directory Node installiert werden.

source: Make sure ucs-school-umc-installer is installed on the Primary Directory Node and all join scripts are executed.
de: Bitte stellen Sie sicher, dass ucs-school-umc-installer auf dem Primary Directory Node installiert ist und alle Joinskripte ausgeführt wurden.

source: Please install UCS@school on the Primary Directory Node. Cannot proceed installation on this system.
de: Bitte installieren Sie UCS@school auf dem Primary Directory Node. Die Installation kann nicht fortgesetzt werden.

source: Preparing domain join...
de: Vorbereiten des Domänenbeitritts...

source: Server type has to be set for Replica Directory Node
de: Es muss ein Servertyp (Edukativ/Verwaltung) für den Replica Directory Node angegeben werden.

source: Software packages have been installed successfully, however, some join scripts could not be executed. More details can be found in the log file /var/log/univention/join.log. Please retry to execute the join scripts via the UMC module "Domain join" after resolving any conflicting issues.
de: Die Softwarepakete wurden erfolgreich installiert, jedoch konnten einige Join-Skripte nicht ausgeführt werden. Mehr Hinweise können in der Log-Datei /var/log/univention/join.log gefunden werden. Nach Beheben der entsprechenden Konflikte können die entsprecheden Join-Skripte über das UMC-Modul "Domänenbeitritt" noch einmal ausgeführt werden.

source: Software packages have been installed successfully, however, the join process could not be executed. More details can be found in the log file /var/log/univention/join.log. Please retry to join the system via the UMC module "Domain join" after resolving any conflicting issues.
de: Die Softwarepakete wurden erfolgreich installiert, jedoch konnte der Domänenbeitritt nicht ausgeführt werden. Mehr Hinweise können in der Log-Datei /var/log/univention/join.log gefunden werden. Nach Beheben der entsprechenden Konflikte kann der Domänenbeitritt über das UMC-Modul "Domänenbeitritt" noch einmal ausgeführt werden.

source: Software packages have been installed, however, the system join could not be completed: %s. More details can be found in the log file /var/log/univention/join.log. Please retry the join process via the UMC module "Domain join" after resolving any conflicting issues.
de: Die Softwarepakete wurden erfolgreich installiert, jedoch konnte der Domänenbeitritt nicht abgeschlossen werden: %s. Mehr Hinweise können in der Log-Datei /var/log/univention/join.log gefunden werden. Nach Beheben der entsprechenden Konflikte kann der Domänenbeitritt über das UMC-Modul "Domänenbeitritt" abgeschlossen werden.

source: The LDAP connection to the Primary Directory Node failed.
de: Eine LDAP-Verbindung zu dem Primary Directory Node konnte nicht aufgebaut werden.

source: The Primary Directory Node is not configured for a UCS@school multi server environment. Cannot proceed installation on this system.
de: Das UCS@school Primary Directory Node ist nicht für den Multi-Server-Einsatz konfiguriert. Die Installation kann nicht fortgesetzt werden.

source: The UCS@school Primary Directory Node needs to be configured similarly to this Backup Directory Node. Please choose the correct environment type for this system.
de: Das UCS@school Primary Directory Node muss gleich wie der Backup Directory Node konfiguriert werden. Bitte wählen Sie die dem Primary Directory Node entsprechende Konfiguration für dieses System aus.

source: The UCS@school software packages have been installed, however, a school OU could not be created and consequently a re-join of the system has not been performed. Please create a new school OU structure using the UMC module "Add schools" on the Primary Directory Node and perform a domain join on this machine via the UMC module "Domain join".
de: Die UCS@school-Softwarepakete wurden erfolgreich installiert, jedoch konnte eine Schul-OU nicht erzeugt werden, so dass ein Domänenbeitritt des Systems nicht durchgeführt wurde. Bitte erstellen Sie eine neue Schul-OU-Struktur über das UMC-Modul "Schule hinzufügen" auf dem Primary Directory Node und führen Sie einen Domänenbeitritt auf diesem Replica Directory Node über das UMC-Modul "Domänenbeitritt" durch.

source: The entered FQDN is not a valid value
de: Der eingegebene Domänenname ist ungültig

source: The name of an educational server has to be specified if the system shall be configured as administrative server.
de: Der Name eines edukativen Schulservers muss angegeben werden, wenn das aktuelle System als Verwaltungsserver konfiguriert werden soll.

source: The name of the educational server may not be equal to the name of the administrative Replica Directory Node.
de: Der Name eines edukativen Schulservers darf nicht mit dem Namen des Verwaltungsservers übereinstimmen!

source: The specified school OU is not valid.
de: Die angegebene Schul-OU ist ungültig.

source: This UCS domain uses Samba 3 which is no longer supported by UCS@school. Please update all domain systems to samba 4 to be able to continue.
de: Diese UCS-Domäne verwendet Samba 3, welches von UCS@school nicht mehr unterstützt wird. Um fortzusetzen, muss die UCS-Domäne auf Samba 4 aktualisiert werden.

source: Validating the LDAP school OU structure failed. It seems that the current Replica Directory Node has already been assigned to a different school or that the specified school OU name is already in use.
de: Die Überprüfung der LDAP-Schul-OU-Struktur ist fehlgeschlagen. Es scheint, dass der aktuelle Replica Directory Node bereits einer anderen Schule zugeordnet ist, oder dass der angegebene Schul-OU-Name bereits in Verwendung ist.

source: finished...
de: beendet...
