Repository: openfnord/ucs-school
Catalog: ucs-school-umc-import/umc/js/*.po
Languages: de

source: A new import of %(role)s users at school %(school)s has been started. The import has the ID %(id)s.
de: Ein neuer Benutzerimport für %(role)s an der Schule %(school)s wurde gestartet. Der Import hat die ID %(id)s.

source: Aborted
de: Abgebrochen

source: An error occurred.
de: Ein Fehler ist aufgetreten.

source: Back to overview
de: Zurück zur Übersicht

source: Click %s to draft an email with all the required information.
de: Klicken Sie %s, um eine E-Mail mit allen notwendigen Informationen zu verfassen.

source: Data examination completed
de: Datenprüfung abgeschlossen

source: Import user accounts
de: Benutzerimport durchführen

source: List of running and completed user imports. For every completed user import a summary is provided with every change that was made as well as a list of passwords for newly created user accounts.
de: Liste der laufenden und abgeschlossenen Benutzerimporte. Für jeden abgeschlossenen Benutzerimport wird eine Zusammenfassung der tatsächlich durchgeführten Änderungen zum Herunterladen bereitgestellt, sowie eine Liste mit Passwörtern für die neu angelegte Benutzerkonten.

source: New
de: Neu

source: Overview User Imports
de: Übersicht Benutzerimporte

source: Passwords
de: Passwörter

source: Please examine the reason for this error: %s
de: Bitte untersuchen Sie den Grund für den Fehler: %s

source: Please notify the system administrator about this error via email.
de: Bitte benachrichtigen Sie den Administrator per E-Mail über den Fehler.

source: Please select a file. This will start a validation proccess of the data.
de: Bitte wählen Sie eine Datei aus. Dies wird den Prüfungsprozess der Daten starten.

source: Please select and upload the data export from the School Information System.
de: Bitte wählen Sie den Datenexport aus der Schuldatenverwaltung und laden Sie diesen hoch

source: Please select the school and the user role for the import.
de: Bitte wählen Sie die Schule und den Benutzertyp für den Import aus.

source: Please wait until the examination of the data is complete.
de: Bitte warten Sie bis die Prüfung der Daten abschlossen ist.

source: Reload
de: Aktualisieren

source: Scheduled
de: Geplant

source: School
de: Schule

source: Select file
de: Datei auswählen

source: Select the school where the import should be done.
de: Wählen Sie die Schule an dem der Import durchgeführt werden soll.

source: Select the user role.
de: Wählen Sie die Benutzerrolle aus.

source: Start import
de: Import starten

source: Start new user import
de: Neuen Benutzerimport durchführen

source: Started
de: Gestartet

source: Started at
de: Gestartet am

source: Started by
de: Durchgeführt von

source: Successful
de: Erfolgreich

source: Summary
de: Zusammenfassung

source: The examination of the uploaded data completed successfully. In the following, you can see the output of the data import interface. Press "Start Import" to proceed with the actual user import.
de: Die Prüfung der hochgeladenen Daten wurde erfolgreich abgeschlossen. Im Folgenden wir die Ausgabe der Schnittstelle zum Datenimport angezeigt. Klicken Sie auf "Import starten", um den Benutzerimport durchzuführen.

source: The import was started successfully.
de: Der Import wurde erfolgreicht gestartet.

source: Upload data
de: Daten hochladen

source: User import: Error in job %s
de: Benutzerimport: Fehler in Job %s

source: User role
de: Benutzerrolle

source: View finished imports
de: Abgeschlossene Import anzeigen

source: here
de: hier
