Repository: openfnord/ucs-school
Catalog: ucs-school-umc-groups/umc/js/*.po
Languages: de

source: Activate Email Address
de: Email-Adresse aktivieren

source: Add workgroup
de: Arbeitsgruppe hinzufügen

source: All students
de: Alle Schüler

source: All teachers
de: Alle Lehrer

source: All users
de: Alle Benutzer

source: Assigning of classes to a teacher
de: Zuweisen von Klassen zu einem Lehrer

source: Back to overview
de: Zurück zur Übersicht

source: Cancel
de: Abbrechen

source: Class
de: Klasse

source: Classes
de: Klassen

source: Create a new workgroup
de: Erstellen einer neuen Arbeitsgruppe

source: Create share
de: Freigabe erstellen

source: Delete
de: Löschen

source: Deleting the selected objects.
de: Löschen der ausgewählten Objekte

source: Description
de: Beschreibung

source: Edit
de: Bearbeiten

source: Edit class
de: Klasse bearbeiten

source: Edit the selected object
de: Bearbeiten des ausgewählten Objektes

source: Edit workgroup
de: Arbeitsgruppe bearbeiten

source: Email address
de: Email-Adresse

source: If checked an email address will be created for this group
de: Für diese Gruppe wird eine Email Adresse erstellt, wenn diese Option ausgewählt wird

source: If checked, a share is created for the new group
de: Für diese Gruppe wird eine Freigabe erstellt, wenn diese Option ausgewählt wird

source: List of classes which the selected teacher is member of
de: Liste der Klassen, in denen der ausgewählte Lehrer Mitglied ist

source: List of teachers which are member of the specified class
de: Liste der Lehrer, die Mitglied der ausgewählten Klasse sind

source: May only consist of letters, digits, spaces, dots, hyphens, underscore. Has to start and to end with a letter or a digit.
de: Darf nur aus Buchstaben, Ziffern, Punkten, Bindestrichen, Unterstrichen bestehen. Muss mit einem Buchstaben oder einer Zahl beginnen und enden.

source: Members
de: Mitglieder

source: Restrict permission to send emails to this group to the following groups
de: Beschränke das Recht, Emails and diese Gruppe zu versenden, auf die folgenden Gruppen

source: Restrict permission to send emails to this group to the following users
de: Beschränke das Recht, Emails an diese Gruppe zu versenden, auf die folgenden Benutzer

source: Save changes
de: Änderungen speichern

source: School
de: Schule

source: Search pattern
de: Suchmuster

source: Search...
de: Suche...

source: Share created
de: Freigabe erstellt

source: Should the selected workgroups be deleted?
de: Sollen die ausgewählten Arbeitsgruppen gelöscht werden?

source: Specifies the substring pattern which is searched for in the displayed name
de: Nach dieser Zeichenkette soll in den angezeigten Namen gesucht werden

source: Students
de: Schüler

source: Teacher
de: Lehrer

source: Teachers
de: Lehrer

source: Teachers and students that belong to the current workgroup
de: Lehrer und Schüler, die zu der aktuellen Arbeitsgruppe gehören

source: The workgroups could not be deleted ({message})
de: Die Arbeitsgruppen konnten nicht gelöscht werden ({message})

source: The workgroups have been deleted successfully
de: Die Arbeitsgruppen wurden erfolgreich gelöscht

source: This module allows the maintenance of class memberships of teachers. The selected teacher can be added to one or multiple classes.
de: Dieses Modul erlaubt die Pflege der Klassenmitgliedschaften von Lehrern. Der ausgewählte Lehrer kann zu einer oder mehreren Klassen hinzugefügt werden.

source: This module allows the maintenance of the membership of class groups. Teachers can be assigned or removed as group members.
de: Dieses Modul erlaubt die Pflege der Mitgliedschaften von Klassengruppen. Lehrer können als Gruppenmitglieder hinzugefügt oder entfernt werden.

source: This module allows to create, modify and delete class comprehensive workgroups. Arbitrary students and teacher of the school can be selected as group members.
de: Dieses Modul erlaubt das Erstellen, Bearbeiten und Löschen von klassenübergreifenden Arbeitsgruppen. Als Gruppenmitglieder können beliebige Schüler und Lehrer der Schule ausgewählt werden.

source: This module allows to modify class comprehensive workgroups. Arbitrary students and teacher of the school can be selected as group members.
de: Dieses Modul erlaubt das Bearbeiten von klassenübergreifenden Arbeitsgruppen. Als Gruppenmitglieder können beliebige Schüler und Lehrer der Schule ausgewählt werden.

source: User group or class
de: Benutzergruppe oder Klasse

source: Verbose description of the group
de: Ausführliche Beschreibung der Gruppe

source: Workgroup
de: Arbeitsgruppe
