Repository: openfnord/ucs-school
Catalog: ucs-school-umc-exam/umc/js/*.po
Languages: de

source: #Students
de: #Schüler

source: <p>For the correct functioning of the exam mode, it is important that all student computers in the computer room are rebooted. The listed computers can be automatically rebooted by pressing the button <i>Reboot students computers</i>. Alternatively multiple computers can be selected and manually rebooted by pressing the button <i>Reboot selected computers</i>.</p><p><b>Attention:</b> No warning will be displayed to currently logged in users! The reboot will be executed immediately.</p>
de: <p>Für die Funktion des Klassenarbeitsmodus ist es wichtig, dass alle Schülerrechner des Computerraums neu gestartet werden. Durch Drücken der Schaltfläche <i>Schülerrechner neustarten</i> können die aufgelisteten Rechner automatisch neu gestartet werden. Alternativ können mehrere Computer ausgewählt und manuell durch Drücken der Schaltfläche <i>Ausgewählte Computer neustarten</i> neu gestartet werden.</p><p><b>Achtung:</b> Es erfolgt keine Warnung bei angemeldeten Benutzern! Der Neustart wird sofort ausgeführt!</p>

source: <p>In this text box you can list websites that are allowed to be used by the students. Each line should contain one website. Example: </p><p style="font-family: monospace">univention.com<br/>wikipedia.org<br/></p>
de: <p>In diesem Eingabefeld können die Webseiten angegeben werden, die von Schülern verwendet werden dürfen. Jede Zeile sollte dabei eine Webseite enthalten, bspw.: </p><p style="font-family: monospace">univention.com<br/>wikipedia.org<br/></p>

source: <p>Please choose a appropriate directory name for the exam and upload all necessary files one by one.</p><p>These files will be distributed to all participating students. A copy of the original files will be stored in your home directory. At any moment during the exam, it is possible to collect the student files. The collected files will be stored in the exam directory of your home directory.</p>
de: <p>Bitte wählen Sie einen passenden Verzeichnisnamen für die Klassenarbeit aus und laden Sie alle notwendigen Dateien nacheinander hoch.</p><p>Diese Dateien werden an alle teilnehmenden Schüler ausgeteilt. Eine Kopie der Originaldateien wird in Ihrem Heimatverzeichnis abgelegt. Zu jedem Zeitpunkt der laufenden Klassenarbeit können die Schülerdateien eingesammelt werden. Diese eingesammelten Dateien werden im Klassenarbeitsverzeichnis Ihres Heimatverzeichnisses gespeichert.</p>

source: <p>Please select the room in which the exam is written and select classes or workgroups that shall participate in the exam.</p>
de: <p>Bitte wählen Sie den Raum, in dem die Klassenarbeit geschrieben wird und wählen Sie Klassen oder Arbeitsgruppen aus, die an der Klassenarbeit teilnehmen sollen.</p>

source: <p>The exam mode allows one to perform an exam in a computer room. During the exam, access to internet as well as to shares can be restricted, the student home directories are not accessible, either.</p><p>Please enter a name for the new exam and specify its end time</p>
de: <p>Der Klassenarbeitsmodus ermöglicht es, eine Klassenarbeit in einem Computerraum zu schreiben. Für den Zeitraum der Klassenarbeit kann der Zugang zum Internet sowie zu Freigaben eingeschränkt werden. Es wird sichergestellt, dass der Zugriff auf die Heimatverzeichnisse für die Schüler nicht möglich ist.</p><p>Bitte geben Sie den Namen der neuen Klassenarbeit an und definieren Sie eine Endzeit.</p>

source: <p>The preparation of the exam was successful. A summary of the exam properties is displayed below.<p><p>Press the button "Open computer room" to finish this wizard and open selected computer room directly.</p><p><b>Attention:</b> For the exam, students are required to login with a special user account by adding <i>{prefix}</i> to their common username, e.g., <i>{prefix}joe123</i> instead of <i>joe123</i>.</p>
de: <p>Die Vorbereitung der Klassenarbeit war erfolgreich. Eine Zusammenfassung aller Einstellungen wird unten stehend angezeigt.</p><p>Bitte drücken Sie die Schaltfläche "Computerraum öffnen", um den Assistenten zu beenden und den ausgewählten Computerraum direkt zu öffnen.</p><p><b>Achtung:</b> Für die Klassenarbeit müssen sich die Schüler mit einem speziellen Benutzernamen anmelden, indem sie <i>{prefix}</i> ihrem gewohnten Benutzernamen voranstellen, also bspw. <i>{prefix}anton123</i> anstelle von <i>anton123</i>.</p>

source: Access permissions for shares
de: Zugriffsberechtigungen für Freigaben

source: All exams
de: Alle Klassenarbeiten

source: Allow access to all shares
de: Zugriff auf alle Freigaben erlauben

source: An error occurred during the preparation of the exam. The following information will show more details about the exact error. Please retry to start the exam.
de: Ein Fehler trat während der Vorbereitung der Klassenarbeit auf. Die folgenden Informationen geben mehr Details über die genaue Art des Fehlers. Bitte versuchen Sie, die Klassenarbeit erneut zu starten.

source: An error ocurred
de: Ein Fehler trat auf

source: An unexpected error occurred.
de: Ein unerwarteter Fehler trat auf.

source: Assign internet rules
de: Internetregeln zuweisen

source: Cancel
de: Abbrechen

source: Choose the computer room in which the exam will take place
de: Auswahl des Computerraumes, in dem die Klassenarbeit statt finden wird

source: Choose the school
de: Auswahl der Schule

source: Classes
de: Klassen

source: Close Wizard
de: Wizard schließen

source: Computer room
de: Computerraum

source: Configure share access
de: Freigabezugriff konfigurieren

source: Continue without reboot
de: Weiter ohne Neustart

source: Default (global settings)
de: Standard (globale Einstellungen)

source: Defines restriction for the share access
de: Definiert Einschränkungen für den Zugriff auf Freigaben

source: Delete
de: Löschen

source: Delete exam(s)
de: Klassenarbeit(en) löschen

source: Directory name
de: Verzeichnisname

source: Distribute teaching materials
de: Unterrichtsmaterial verteilen

source: Distributed teaching materials
de: Verteilte Unterrichtsmaterialien

source: Do you really want to delete %s?
de: Möchten Sie %s wirklich löschen?

source: Edit exam
de: Klassenarbeit bearbeiten

source: Exam files only
de: Nur Prüfungsdateien

source: Exam name
de: Name der Klassenarbeit

source: Exam successfully prepared
de: Klassenarbeit erfolgreich angelegt

source: Files that are distributed along with this exam
de: Diese Dateien werden für die Klassenarbeit an die Schüler verteilt

source: Groups that are participating in the exam
de: Die an der Klassenarbeit teilnehmenden Gruppen

source: In this computer room the exam "%s" is currently being executed by %s.
de: In diesem Computerraum wird derzeit die Klassenarbeit "%s" von %s durchgeführt.

source: In this computer room the exam "%s" is currently being written.
de: In diesem Computerraum wird derzeit die Klassenarbeit "%s" durchgeführt.

source: List of allowed websites for "{myRules}"
de: Liste erlaubter Webseiten für "{myRules}"

source: Next
de: Weiter

source: No class or workgroup has been selected for the exam. Please select at least one class or workgroup.
de: Für die Klassenarbeit wurde keine Klasse oder Arbeitsgruppe ausgewählt. Bitte wählen Sie mindestens eine Klasse oder Arbeitsgruppe aus.

source: No reboot necessary
de: Kein Neustart notwendig

source: No room has been selected for the exam. Please select a room.
de: Für die Klassenarbeit wurde kein Raum ausgewählt. Bitte wählen Sie einen Raum aus.

source: Not connected / powered down
de: Nicht verbunden / ausgeschaltet

source: Note
de: Hinweis

source: Only own exams
de: Nur eigene Klassenarbeiten

source: Open computer room
de: Computerraum öffnen

source: Participants
de: Teilnehmer

source: Participating classes/workgroups
de: Teilnehmende Klassen/Arbeitsgruppen

source: Personal internet rules
de: Eigene Internetregeln

source: Planned end of exam
de: Geplantes Ende der Klassenarbeit

source: Please confirm to reboot all computers marked as <i>Reboot necessary</i> immediately.
de: Bitte bestätigen Sie den umgehenden Neustart aller Rechner, die mit <i>Neustart notwendig</i> markiert sind.

source: Please select the access restrictions to internet. These settings can also be adjusted during the exam via the room settings in the module <i>Computer room</i>.
de: Bitte wählen Sie die Einschränkungen für den Zugang zum Internet. Diese Einstellungen können während der Klassenarbeit jederzeit über die Raumeinstellungen des Moduls <i>Computerraum</i> geändert werden.

source: Please select the access restrictions to shares. These settings can also be adjusted during the exam via the room settings in the module <i>Computer room</i>. The participating students are not able to access the home directories during the exam.
de: Bitte wählen Sie die Einschränkungen für den Zugang zu Freigaben. Diese Einstellungen können während der Klassenarbeit jederzeit über die Raumeinstellungen des Moduls <i>Computerraum</i> geändert werden. Die teilnehmenden Schüler können während der Klassenarbeit nicht auf ihre Heimatverzeichnisse zugreifen.

source: Please select your further configuration steps:
de: Wählen Sie Ihre weiteren Konfigurationsschritte:

source: Please specify at least one allowed website or select a different internet rule.
de: Bitte definieren Sie mindestens eine erlaubte Webseite oder wählen Sie eine andere Internetregel.

source: Prepare new exam
de: Eine neue Klassenarbeit anlegen

source: Reboot
de: Neustart

source: Reboot computers
de: Rechner neustarten

source: Reboot necessary
de: Neustart notwendig

source: Reboot selected computers
de: Ausgewählte Rechner neustarten

source: Reboot student computers
de: Schülerrechner neustarten

source: Rebooting computers
de: Rechner neustarten

source: Regulate share access
de: Freigabezugriff steuern

source: Room
de: Raum

source: Save exam
de: Klassenarbeit speichern

source: School
de: Schule

source: School classes
de: Schulklassen

source: Search name
de: Suchname

source: Search pattern
de: Suchbegriff

source: Search...
de: Suche...

source: Select a predefined internet rule. Alternatively <i>Personal internet rules</i> can be defined or the standard internet rules of the school administrator can be used.
de: Auswahl einer vordefinierten Internetregel. Alternativ können <i>Eigene Internetregeln</i> definiert werden oder die Standardregeln des Schuladministrators verwendet werden.

source: Select room and participants
de: Raum und Teilnehmer auswählen

source: Set up internet rules
de: Internetregeln definieren

source: Specifies the substring pattern which is searched for in the exams.
de: Gibt die Zeichenkette an, nach der die Klassenarbeiten gesucht werden.

source: Start a new exam
de: Eine neue Klassenarbeit starten

source: Start exam
de: Klassenarbeit starten

source: Starting the configuration process...
de: Beginn des Konfigurationsprozesses...

source: Take over
de: Übernehmen

source: The following special characters are not allowed: "/", "\", "?", "%", "*", ":", "|", """, "<", ">", "$", "'". Additionally, the project directory may not start nor end with a "." or a space.
de: Die folgenden Sonderzeichen sind nicht erlaubt: "/", "\", "?", "%", "*", ":", "|", """, "<", ">", "$", "'". Zusätzlich darf das Projektverzeichnis nicht mit "." beginnen oder enden.

source: The name of the exam, e.g., "Math exam algebra 02/2013".
de: Der Name der Klassenarbeit, bspw. "Mathematik-Klausur 02-2013".

source: The name of the project directory as it will be displayed in the file system. The following special characters are not allowed: "/", "\", "?", "%", "*", ":", "|", """, "<", ">", "$", "'". Additionally, the project directory may not start or end with a ".".
de: Der Name des Projektverzeichnisses wie es im Dateisystem dargestellt wird. Die folgenden Sonderzeichen sind nicht erlaubt: "/", "\", "?", "%", "*", ":", "|", """, "<", ">", "$", "'". Zusätzlich darf das Projektverzeichnis nicht mit "." beginnen oder enden.

source: The room %s cannot be chosen as the exam "%s" is currently being conducted. Please make sure that the exam is finished via the module "Computer room" before a new exam can be started again.
de: Der Raum %s kann nicht ausgewählt werden, da in ihm bereits die Klassenarbeit "%s" durchgeführt wird. Bitte stellen Sie sicher, dass die Klassenarbeit zunächst über das Modul "Computerraum" beendet wird bevor eine neue Klassenarbeit gestartet wird.

source: The time when the exam ends
de: Der Endzeitpunkt der Klassenarbeit

source: This computer room is currently in use by %s.
de: Dieser Computerraum wird derzeit verwendet von %s.

source: This computer room is currently in use by %s. You can take control over the room, however, the current teacher will be prompted a notification and its session will be closed.
de: Dieser Computerraum wird derzeit verwendet von %s. Sie können die Kontrolle des Raums übernehmen, dazu wird dem momentanen Lehrer ein Hinweis angezeigt und seine Sitzung geschlossen.

source: Upload files
de: Dateien hochladen

source: Upload of exam files
de: Hochladen von Klassenarbeitsdateien

source: User
de: Benutzer

source: Web access profile
de: Internetregeln

source: pending
de: ausstehend

source: started
de: gestartet
