Repository: openfnord/ucs-school
Catalog: ucs-school-umc-internetrules/umc/js/*.po
Languages: de

source: -- None (unrestricted/no WLAN) --
de: -- Keine (Unbeschränkt/kein WLAN) --

source: 0 (low)
de: 0 (niedrig)

source: 10 (high)
de: 10 (hoch)

source: 5 (average)
de: 5 (mittel)

source: A <i>whitelist</i> defines the list of domains that can be browsed to, the access to all other domains will be blocked. A <i>blacklist</i> allows access to all existing domains, only the access to the specified list of domains will be denied.
de: Eine <i>Freigabeliste</i> definiert einen Satz an Internetdomänen, die betrachtet werden können; dabei wird der Zugang zu allen anderen Domänen unterbunden. Eine <i>Sperrlist</i> erlaubt den Zugang zu jeglichen Domänen, allerdings werden die angegebenen Domänen blockiert.

source: A list of internet domains, such as wikipedia.org, youtube.com. It is recommended to specify only the last part of a domain, i.e., wikipedia.org instead of www.wikipedia.org.
de: Eine Liste von Internetdomänen, wie z.B. wikipedia.org, youtube.com. Es wird empfohlen, nur den letzten Teil einer Domäne anzugeben, bspw. wikipedia.org anstelle von www.wikipedia.org.

source: Add rule
de: Regel hinzufügen

source: Administration of internet rules
de: Verwalten der Internetregeln

source: Advanced properties
de: Erweiterte Einstellungen

source: Assign an internet rule to the selected groups
de: Eine Regel den ausgewählten Gruppen zuweisen

source: Assign internet rule
de: Internetregel zuweisen

source: Assign rule
de: Regel zuweisen

source: Assignment of internet rules
de: Zuweisung von Internetregeln

source: Associated rule
de: Verknüpfte Regel

source: Back to overview
de: Zurück zur Übersicht

source: Blacklist
de: Sperrliste

source: Cancel
de: Abrechen

source: Choose the internet rule
de: Internetregel auswählen

source: Create a new rule
de: Erstellen einer neuen Regel

source: Delete
de: Löschen

source: Delete the selected rules.
de: Löschen der markierten Regeln

source: Edit
de: Bearbeiten

source: Edit internet rule
de: Internetregel bearbeiten

source: Edit the selected rule
de: Bearbeiten der ausgewählten Regel

source: Group name
de: Gruppenname

source: Internet rule
de: Internetregel

source: Please confirm to remove the following %d filter rules: %s
de: Bitte bestätigen, um die folgenden %d Internetregel zu löschen: %s

source: Please confirm to remove the following filter rule: %s
de: Bitte bestätigen, um die folgende Internetregel zu löschen: %s

source: Priority
de: Priorität

source: Removal of the following rules failed:%s
de: Das Entfernen der folgenden Regel schlug fehl: %s

source: Remove rule
de: Regel entfernen

source: Remove rules
de: Regeln entfernen

source: Rule properties
de: Regeleigenschaften

source: Rule type
de: Regeltyp

source: Save
de: Speichern

source: School
de: Schule

source: Search pattern
de: Suchbegriff

source: Search results
de: Suchergebnisse

source: Search...
de: Suche...

source: Specifies the substring pattern which is searched for in the group properties
de: Zeichenkette, nach der in den Gruppeneigenschaften gesucht wird

source: Specifies the substring pattern which is searched for in the rules' names and their domain lists
de: Zeichenkette, nach der im Regelnamen und der Domänenliste gesucht wird

source: The chosen internet rule will be assigned to the following group: %s
de: Die ausgewählte Internetregel wird der folgenden Gruppe zugewiesen werden: %s

source: The chosen internet rule will be assigned to the following groups:
de: Die ausgewählte Internetregel wird den folgenden Gruppen zugewiesen werden:

source: The name of the rule
de: Name der Regel

source: The priority allows to define an order in which a set of rules will be applied. A rule with a higher priority will overwrite rules with lower priorities.
de: Die Priorität ermöglicht es die Reihenfolge zu definieren, in der die Internetregeln angewandt werden. Eine Regel mit höherer Priorität überschreibt dabei die Einstellungen der Regeln mit niedriger Priorität.

source: Type
de: Typ

source: Unknown
de: Unbekannt

source: WLAN authentification enabled
de: WLAN-Authentifizierung aktiviert

source: Web domain list
de: Internet-Domänenliste

source: Web domains (e.g., wikipedia.org, facebook.com)
de: Internet-Domänen (z.B., wikipedia.org, facebook.com)

source: Whitelist
de: Freigabeliste

source: Wifi
de: WLAN

source: blacklist
de: Sperrliste

source: disabled
de: deaktiviert

source: enabled
de: aktiviert

source: whitelist
de: Freigabeliste
