Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-lists/umc/js/*.po
Languages: fr

source: Class or workgroup
fr: Classe ou groupe de travail

source: Download a list of group members
fr: Télécharger la liste des membres du groupe

source: Download a list of group members (in an alternative format)
fr: Télécharger la liste des membres du groupe (dans un format alternatif)

source: Export (Alternative format)
fr: Exporter (format alternatif)

source: Export (Recommended)
fr: Exporter (recommandé)

source: Please select a class or workgroup.
fr: Veuillez sélectionner une classe ou un groupe de travail.

source: School
fr: École

source: Select a class or workgroup.
fr: Sélectionnez une classe ou un groupe de travail.

source: Select the school.
fr: Sélectionnez l’école.

source: This module lets you export class and workgroup lists. The lists are in the CSV format. If you have problems opening the exported file, ensure the encoding is set to UTF-16 and the field separator is set to tabs.<p><a target='_blank' href=modules/schoollists/lo_import_hl_en.png>Help for LibreOffice</a></p><p>If you can't open that file you can try to export the list in an alternative format which is UTF-8 encoded and uses commas as field separators.</p>
fr: Ce module vous permet d’exporter des listes de classes et de groupes de travail. Les listes sont au format CSV. Si vous rencontrez des problèmes pour ouvrir le fichier exporté, assurez-vous que le codage est réglé sur UTF-16 et que le séparateur de champs sélectionné est la tabulation.<p><a target='_blank' href=modules/schoollists/lo_import_hl_en.png>Aide pour LibreOffice</a></p><p>Si vous ne pouvez pas ouvrir ce fichier, vous pouvez essayer d’exporter la liste dans un format alternatif codé en UTF-8 et utilisant des virgules comme séparateurs de champs.</p>
