Repository: openfnord/ucs-school
Catalog: ucs-school-l10n-*/*/ucs-school-umc-groups/umc/js/*.po
Languages: fr

source: Activate Email Address
fr: Activer l’adresse e-mail

source: Add workgroup
fr: Ajouter un groupe de travail

source: All students
fr: Tous les élèves

source: All teachers
fr: Tous les enseignants

source: All users
fr: Tous les utilisateurs

source: Assigning of classes to a teacher
fr: Affectation de classes à un enseignant

source: Back to overview
fr: Retour vers la vue globale

source: Cancel
fr: Annuler

source: Class
fr: Classe

source: Create a new workgroup
fr: Créer un nouveau groupe de travail

source: Create share
fr: Créer un partage

source: Delete
fr: Supprimer

source: Deleting the selected objects.
fr: Suppression des objets sélectionnés.

source: Edit
fr: Modifier

source: Edit class
fr: Modifier la classe

source: Edit the selected object
fr: Modifier l'objet sélectionné

source: Edit workgroup
fr: Modifier le groupe de travail

source: Email address
fr: Adresse e-mail

source: If checked an email address will be created for this group
fr: Si cette option est cochée, une adresse e-mail sera créée pour ce groupe

source: If checked, a share is created for the new group
fr: Si cette option est cochée, un partage est créé pour le nouveau groupe

source: List of classes which the selected teacher is member of
fr: Liste des classes dont l'enseignant sélectionné est membre

source: List of teachers which are member of the specified class
fr: Liste des enseignants membres de la classe indiquée

source: May only consist of letters, digits, spaces, dots, hyphens, underscore. Has to start and to end with a letter or a digit.
fr: Peut uniquement contenir des lettres, des chiffres, des espaces, des points, des tirets, des tirets du bas. Doit commencer et finir par une lettre ou un chiffre.

source: Members
fr: Membres

source: Name
fr: Nom

source: Restrict permission to send emails to this group to the following groups
fr: Restreindre aux groupes suivants l’autorisation d’envoyer des e-mails à ce groupe

source: Restrict permission to send emails to this group to the following users
fr: Restreindre aux utilisateurs et utilisatrices suivant·es l’autorisation d’envoyer des e-mails à ce groupe

source: Save changes
fr: Enregistrer les modifications

source: School
fr: École

source: Search pattern
fr: Motif de recherche

source: Search...
fr: Chercher...

source: Share created
fr: Partage créé

source: Should the selected workgroups be deleted?
fr: Les groupes de travail doivent-ils être supprimés ?

source: Specifies the substring pattern which is searched for in the displayed name
fr: Indique le motif partiel recherché dans le nom affiché

source: Students
fr: Élèves

source: Teacher
fr: Professeur

source: Teachers
fr: Enseignants

source: Teachers and students that belong to the current workgroup
fr: Enseignant·es et élèves appartenant au groupe de travail actuel

source: The workgroups could not be deleted ({message})
fr: Les groupes de travail n’ont pas pu être supprimés ({message})

source: The workgroups have been deleted successfully
fr: Les groupes de travail ont été supprimés avec succès

source: This module allows the maintenance of class memberships of teachers. The selected teacher can be added to one or multiple classes.
fr: Ce module permet de gérer l'appartenance des enseignants à des classes. L'enseignant sélectionné peut être ajouté à une ou plusieurs classes.

source: This module allows the maintenance of the membership of class groups. Teachers can be assigned or removed as group members.
fr: Ce module permet de gérer l'appartenance à des groupes de classes. Les enseignants peuvent être affectés ou supprimés en tant que membres de groupes.

source: This module allows to create, modify and delete class comprehensive workgroups. Arbitrary students and teacher of the school can be selected as group members.
fr: Ce module permet de créer, modifier et supprimer des groupes de travail globaux. N’importe quel·le élève ou enseignant·e de l’école peut être sélectionné·e comme membre d’un groupe.

source: This module allows to modify class comprehensive workgroups. Arbitrary students and teacher of the school can be selected as group members.
fr: Ce module permet de modifier des groupes de travail globaux. N’importe quel·le élève ou enseignant·e de l’école peut être sélectionné·e comme membre d’un groupe.

source: User group or class
fr: Groupe d'utilisateurs ou classe

source: Verbose description of the group
fr: Description détaillée du groupe

source: Workgroup
fr: Groupe de travail
